[
  {
    "code": "alias_investigations_by_christian_fecteau",
    "name": "Alias Investigations",
    "creator": "Christian Fecteau",
    "description": "Jessica Jones is ready to do whatever it takes to find the culprit of this kidnapping case, and that means she will team up with any hero who agrees to help. Players may choose whatever heroes and aspects they like in any combination. After beginning the campaign, deck lists cannot be modified, so be ready for anything.",
    "epilogue": "Check the Campaign Log. Count the number of checked boxes under “Jessica’s Wounds” and consult the table below.<br><br><b>3 checked boxes</b>: <i>Jessica Jones temporarily closes Alias Investigations. She thanks you for your help and tells you that she needs to take some time before she can get back to working on her own again.</i><br><b>2 checked boxes</b>: <i>You stop in on Alias Investigations a few weeks later. Jessica is mostly the same as you remember her. Business is slow, she tells you, but her clients know that she does good work, and that’s the important thing. You have a feeling that things will be tough for a bit, but she’ll get through it; she always does.</i><br><b>1 checked box</b>: <i>Business seems good for Alias Investigations. Jessica’s reputation in the community has grown since the last time you saw her. She meets up with you to catch up, and you share a good laugh about that one part of the case where she got knocked out and you had to finish the fight for her.</i><br><b>0 checked boxes</b>: <i>After the work done on the kidnapping case, Alias Investigations has a stellar reputation. Crime in the area has dropped significantly since then, and the police often call Jessica in as a consultant. She has also received calls from some superhero teams that were seeking her advice. The work keeps her busy, but she finds time to send you a letter thanking you for the work you did with her.</i><br><br>Next, tally your victory points from all three scenarios to determine your investigator rank:<br><b>6 or more VP</b>: Super-Sleuth<br><b>4 or 5 VP</b>: Insightful Investigator<br><b>2 or 3 VP</b>: Dauntless Detective<br><b>1 or less VP</b>: Resilient Rookie",
    "image": "alias_investigations.jpg",
    "type": "custom",
    "position": 110,
    "scenarios": [
      {
        "code": "rhino",
        "name": "Scenario #1 - Rhino (AKA Fight at the Facility)",
        "description": "<i>Jessica Jones has asked for your help with tracking down the culprit who kidnapped her client, and so you’ve met her at her office – Alias Investigations – to work with her and figure out a strategy. Her investigation has hit a few dead ends, but she tells you that one of her contacts has reached out to her with a new lead: a folder of case files that are currently stored inside a safety deposit box at a S.H.I.E.L.D. facility.</i><br><br><i>Right after she mentions this, the words “breaking news” flash across the screen of Jessica’s old TV: Rhino is forcing his way into a nearby S.H.I.E.L.D. site, and authorities are advising everyone to steer clear until the situation is resolved. You turn to Jessica, as though to ask if this might be the same S.H.I.E.L.D. building where the documents are being stored, but you can already tell the answer to that question from the way that Jessica is holding her head in her hands and sighing exasperatedly.</i><br><br><i>There’s no time to prepare or speculate as to whether the timing of Rhino’s attack is a coincidence – you and Jessica grab your things and rush to the facility. Heroics first, ask questions later.</i>",
        "introduction": "After Step 1 (Select Heroes), each player records their name, identity, and aspect in the Campaign Log.<br>After Step 11 (Shuffle Encounter Deck), assemble the Clue Deck using the following three cards: Radioactive Man (Core Set #129), Madame Hydra (Core Set #181), and Mystique (Mutant Genesis #80).<br>After Step 13 (Resolve Mulligans), the first player searches for the Jessica Jones ally (Core Set #59) and places her in play under the first player's control.<br><br><b>Special Rules:</b><br>For the duration of the scenario, Jessica Jones gains the text “Victory -1” and “Jessica Jones does not count against your ally limit.”<br>When players defeat Stage I of the Villain (or Stage II in Expert Mode), reveal the top card of the Clue Deck.<br>Cards from the Clue Deck gain the text “Victory 2”.",
        "resolution": "Check the victory display at the end of the scenario:<br><ul><li>If Jessica Jones is in the victory display, check one box under “Jessica’s Wounds” in the Campaign Log.</li><li>If the card revealed from the Clue Deck is in the victory display, record its name under “Evidence Collected”.</li><li>If the revealed card is not in the victory display, record its name under “Leads Pursued”.</li><li>Record the total victory value of cards in the victory display in the “Victory Tally” section.</li></ul><br><b>Expert Mode Only:</b> Record each Identity's remaining hit points.",
        "epilogue": "",
        "image": "rhino_facility.jpg"
      },
      {
        "code": "project_wideawake",
        "name": "Scenario #2 - Sentinel (AKA Brawl at the Mall)",
        "description": "<i>Although Rhino seemed to have no interest in the case file at the facility, another foe appeared partway through the battle, and they were determined to keep you from getting the contents of the safety deposit box. While it occurred to you that the enemy you encountered might be the person behind the kidnapping, Jessica doesn’t seem convinced; she thinks the real kidnapper probably sent someone to steal the files for them and wouldn’t risk going in person. “That one’s likely working with the kidnapper, though,” Jessica says. “I doubt we’ve seen the last of them.”</i><br><br><i>The documents you recovered from the facility are dense; you and Jessica take the files back to her office and start reading through them. As it turns out, Jessica’s client isn’t the only person kidnapped – the information you’ve found says that there’s been several superpowered people who have gone missing within the last few weeks, and all of them disappeared within a two-mile radius of the local mall. If what you’re reading is true, then it’s possible that all the kidnappings are the work of the same individual. There’s only one way to find out, so you and Jessica head to the mall to check things out for yourselves.</i>",
        "introduction": "<b>Setup:</b><br>After Step 8, check the Campaign Log. If Radioactive Man, Madame Hydra, or Mystique are listed under “Leads Pursued” or “Evidence Collected”, add their corresponding encounter set (Masters of Evil, Legions of Hydra, or Mystique) to the encounter deck.<br>After Step 10, search for any cards listed under “Leads Pursued” and put them into play. Each card gains the text “Victory 1”.<br>After Step 11, assemble the Clue Deck using: Taskmaster’s Training Camp (#108), Test Subjects (#123), and Intruder Alert! (#19).<br>After Step 13, place the Jessica Jones ally in play under the first player’s control with her campaign text (“Victory -1”, does not count against ally limit).<br><br><b>Special Rules:</b><br>When players defeat Stage I (or II in Expert), reveal the top card of the Clue Deck. It gains “Victory 2”.",
        "resolution": "Record the results of the investigation:<br><ul><li>If Jessica Jones is in the victory display, check one box under “Jessica’s Wounds”.</li><li>If the card revealed from the Clue Deck is in the victory display, record it as “Evidence Collected”; otherwise, record it as “Leads Pursued”.</li><li>If a card listed under “Leads Pursued” is in the victory display, cross it out and record it in “Evidence Collected”.</li><li>For each Captive ally that entered play (including Jubilee), record their name under “Victims Rescued”.</li><li>Record the total victory value in the “Victory Tally”.</li></ul><br><b>Expert Mode Only:</b> Record each Identity's remaining hit points.",
        "epilogue": "",
        "image": "sentinel_mall.jpg"
      },
      {
        "code": "the_kidnapper_aka_the_final_battle",
        "name": "Scenario #3 - The Kidnapper (AKA The Final Battle)",
        "description": "<i>After the battle at the mall, you and Jessica now know the identity of the kidnapper. You’ve discovered that they’ve used modified Sentinels to commit the kidnappings, and they’ve also enlisted minions to help cover their tracks. They didn’t cover things up well enough, though, because now you and Jessica know where to find them. All you need to do now is stop them.</i>",
        "introduction": "<b>Villain Selection:</b><br>Check the Campaign Log for “Leads Pursued” or “Evidence Collected”:<br>If <b>Taskmaster’s Training Camp</b> is listed: Villain is Taskmaster (Encounter Deck: Hydra Patrol).<br>If <b>Test Subjects</b> is listed: Villain is Zola (Main Scheme: The Island of Dr. Zola).<br>If <b>Intruder Alert!</b> is listed: Villain is Master Mold (Encounter Deck: Sentinels).<br><br><b>Setup:</b><br>Add Masters of Evil, Legions of Hydra, or Mystique sets if their corresponding clue cards are listed in the Campaign Log.<br>Place any cards listed under “Leads Pursued” into play (they gain “Victory 1”).<br>Assemble the Clue Deck using the 4 Captive allies (Project Wideawake set), removing any listed under “Victims Rescued”.<br>Place Jessica Jones in play with her campaign text.<br><br><b>Special Rules:</b><br>When Stage I (or II in Expert) is defeated, reveal the top Clue card. It enters play under the first player's control and gains: “This ally does not count towards your ally limit” and “If this card leaves play, the players lose the game.”",
        "resolution": "The final battle is over!<br><ul><li>If Jessica Jones is in the victory display, check one box under “Jessica’s Wounds”.</li><li>If a card listed under “Leads Pursued” is in the victory display, move it to “Evidence Collected”.</li><li>Record the Captive ally's name from the Clue Deck under “Victims Rescued”.</li><li>Record total victory value.</li></ul><br><b>Expert Mode Only:</b> Record each Identity's remaining hit points.<br><br>Proceed to Epilogue.",
        "epilogue": "",
        "image": "final_battle.jpg"
      }
    ],
    "modulars": {
      "rhino": [
        {
          "name": "Weapon Master",
          "code": "weap_master"
        }
      ],
      "project_wideawake": [
        {
          "name": "Masters of Evil",
          "code": "masters_of_evil"
        },
        {
          "name": "Legions of Hydra",
          "code": "legions_of_hydra"
        },
        {
          "name": "Mystique",
          "code": "mystique"
        }
      ],
      "the_kidnapper_aka_the_final_battle": [
        {
          "name": "Hydra Patrol",
          "code": "hydra_patrol"
        },
        {
          "name": "Sentinels",
          "code": "sentinels"
        },
        {
          "name": "Masters of Evil",
          "code": "masters_of_evil"
        },
        {
          "name": "Legions of Hydra",
          "code": "legions_of_hydra"
        },
        {
          "name": "Mystique",
          "code": "mystique"
        }
      ]
    },
    "campaign_notes": [
      "Leads Pursued",
      "Evidence Collected",
      "Victims Rescued"
    ],
    "campaign_counters": [
      "Jessica Wounds",
      "Victory Points"
    ]
  },
  {
    "code": "house_of_mojo_by_amanda_shagoury",
    "name": "House of Mojo",
    "creator": "Amanda Shagoury",
    "description": "<i>This winter the hit TV show everyone has been talking about returns after 20 years. With five years and eight seasons of content to reference, what twists and turns will happen this season on House of Mojo?</i><br><br>This campaign is a celebration of Marvel Champions: The Card Game's 5-year anniversary. Players will take on a specific role within the team. This role will determine what upgrades can be unlocked by that player.",
    "epilogue": "",
    "image": "house_of_mojo.jpg",
    "type": "custom",
    "position": 111,
    "scenarios": [
      {
        "code": "en_sabah_nur",
        "name": "Scenario #1 - Training for the End of the World",
        "description": "<i>After a well-known theme song that you’ll keep humming throughout this campaign, this story starts out like many others, training in the Danger Room. Today’s mission: stop the end of the world. Nothing we haven’t faced before and we all know our roles. We just need to adjust the settings before we start. Now what will help us prepare for anything life throws our way?</i>",
        "introduction": "Each player records their identity in the campaign log and chooses a role from the table (Fighter, Tactician, Protector, or Tank). Put their condition upgrade in play.<br><br>As a team, decide which of these player side schemes you will attempt to complete (choose only one):<br><ul><li>Assemble the Team</li><li>Establish Safehouse</li><li>Gear Up</li><li>Mission Prep</li><li>Practice Maneuvers</li><li>Prepare Defenses</li></ul><br><b>Note:</b> Apocalypse starts the game in his Biomorph form.<br><b>Note:</b> The Clan Akkaba modular encounter set has a card that starts in play (Ancient Ritual).<br><b>Note:</b> The setting encounter sets (Super Strength, Telepathy, Flight) have one attachment that comes into play during setup.",
        "resolution": "Check the setting modular encounter set used (Super Strength, Telepathy, or Flight). Based on the set, each player may add specific aspect or leadership events to their deck. Record the name of the events.<br><br><b>Outcomes:</b><br><ul><li>If the training side scheme was defeated, check “Training Side Scheme Thwarted”.</li><li>If the Hellfire Club modular set was used and defeated, check “Hellfire Club Disbanded”.</li></ul><br><b>Expert Campaign Only:</b> Record each identity's remaining hit points.",
        "epilogue": "",
        "image": "training_apocalypse.jpg"
      },
      {
        "code": "magneto_villain",
        "name": "Scenario #2 - Wanda’s Vision",
        "description": "<i>Right as training ends, the alarm starts to sound. Over the intercom, Professor X says, slightly out of character, “Everyone, to the X-Jet! Cerebro has located a disturbance in the Savage Lands! Based on ratings and our limited time for character development, it seems that the Scarlet Witch is overwhelmed by… grief or something… and must be stopped! Magneto’s protecting her and he would rather destroy the world with Asteroid M than let her come to harm. And Sauron is still a danger roaming those lands! Think of the ratings!”</i>",
        "introduction": "Put the X-Jet into play.<br>Based on their role, each player puts into play their condition upgrade from the table in the campaign log with the basic side facing up.<br><br><b>Campaign Adjustments:</b><br><ul><li>If “Training Side Scheme Thwarted” is checked, put that side scheme in play on its environment side.</li><li>If “Hellfire Club Disbanded” is checked, each player may add one copy of their Scenario #1 Event to their hand (this does not count toward the starting hand limit).</li></ul><br><b>Expert Campaign Only:</b> Set each player’s hit point dial to their remaining hit point value from the previous scenario. Each player may place one acceleration token on the main scheme to heal their identity to full.",
        "resolution": "<b>Sauron:</b> If the Sauron modular set was used, check “Sauron Encountered”.<br><br><b>Advancement:</b> Check how far the main scheme advanced:<br><ul><li>If it reached “The Rule of Magnus”, check “Advanced 2”.</li><li>If it reached “Factory Online”, check “Advanced 1”.</li></ul><br><b>Expert Campaign Only:</b> Record each identity's remaining hit points.",
        "epilogue": "",
        "image": "wandas_vision.jpg"
      },
      {
        "code": "thanos",
        "name": "Scenario #3 - Balance Will Be Restored",
        "description": "<i>You barely scrape by Magneto but can't get to Wanda in time. She changes reality to a world where mutants rule and humans are forced into the shadows. How novel! In the change, many people have become mutants. With the world balance out of whack, that seems like the perfect opportunity for a climactic tie-in, and Thanos has come to Earth to snap the world into alignment. Thankfully, your team is working together better than ever. (Maybe you all could stand together in a circle looking around as you team up for the trailer... Can we get some more wind on Thor's hair??) Will you be able to stop Thanos from snapping half the world's population from existence?</i>",
        "introduction": "For this scenario, all friendly characters gain the MUTANT, X-MEN, X-FORCE, and X-FACTOR traits. Players may include trait-locked cards for these traits.<br><br><b>Setup:</b><br>Place Public Outcry into play. Shuffle Smear Campaign into the encounter deck.<br>If “Training Side Scheme Thwarted” is checked, put the player side scheme into play on its environment side.<br>Based on their role each player puts into play their condition upgrade with the basic side facing up.<br>Each player may put a copy of “Children of the Atom” into play.<br><br><b>Expert Campaign Only:</b> Set HP/Heal. If 'Advanced 2' is checked, put the top card of the Infinity Stone deck into play. If 'Advanced 1' is checked, add one per player threat to the main scheme.",
        "resolution": "Each player chooses to add a copy of Shawarma or the Market Card associated with their role to their deck. Record the decision.<br><br><b>Outcome:</b> If “The Infinity Stones” main scheme did not advance to “Balance the Scales”, check “The Team Has Gotten Stronger”.<br><b>Expert Campaign Only:</b> Record each identity's remaining hit points.",
        "epilogue": "<i>Wanda realizes her error but whispers: “No more mutants.”</i>",
        "image": "thanos_balance.jpg"
      },
      {
        "code": "project_wideawake",
        "name": "Scenario #4 - Saving Grace",
        "description": "<i>90% of the mutant population has lost their powers. The rest of society is afraid of the remaining mutants changing reality again, so they've been rounded up and are under the watchful eyes of the Sentinels. Time for a remarkable escape! The team has a plan to start a new nation for mutants. First, they need to rescue a group of mutants and only then can they escape to Utopia on the X-Jet. The Sentinels won't make this easy. Maybe Magneto will help. (Everyone loves a good cameo, luckily his schedule just cleared up.)</i>",
        "introduction": "<b>Special Rules:</b> To win this scenario, you must complete 4 tasks:<br>1. Defeat the Sentinel villain.<br>2. Rescue the mutants from the mission side scheme.<br>3. Have X-Jet in play.<br>4. Have Utopia in play.<br><br><b>Setup:</b><br>Put the Build Support player side scheme in play.<br>If “Training Side Scheme Thwarted” is checked, put the player side scheme in play on its environment side.<br>If “Sauron Encountered” is checked, put the Magneto ally into play.<br>If “The Team Has Gotten Stronger” is checked, players put their condition upgrade into play on the advanced side.<br>Put the “Find Lost Mutants” mission side scheme in play.<br><br><b>Expert Campaign Only:</b> Set HP/Heal.",
        "resolution": "Each player may add one player side scheme to their deck from any aspect. Record these side schemes.<br>If the Genosha modular set was added, check “Escaped Genosha”.<br><b>Expert Campaign Only:</b> Record each identity's remaining hit points.",
        "epilogue": "<i>The team flies into the sunset towards Utopia.</i>",
        "image": "sentinel_rescue.jpg"
      },
      {
        "code": "mojo",
        "name": "Scenario #5 - Mojo All Along",
        "description": "<i>After a brief song break describing with awkward specificity how Mojo was behind all the twists and turns (something that may have been more of a plot twist if the show didn't have his name in the title), he brings out his Wheel of Genres and says \"What to do now, what to do now? Ah I know! Everyone likes sitcoms. I'm sure Arcade can help us find an interesting twist on the genre. We'll start with that. Quiet on set!\"</i><br><br><i>You are suddenly in a talking head of a family-friendly network sitcom. You need to find a way out of Mojo's clutches to get back to real life. You find Longshot is in the same show. He says, \"I saw how you helped out those mutants. Now let me help you find a way out of here.\"</i>",
        "introduction": "Put Longshot into play under the first player’s control.<br><br><b>Campaign Adjustments:</b><br><ul><li>If the team added the Arcade set, each player adds their Role Upgrade to their deck.</li><li>If “Training Side Scheme Thwarted” is checked, put the player side scheme into play on its environment side.</li><li>If “The Team Has Gotten Stronger” is checked, players put their condition upgrade into play on the advanced side.</li><li>If “Escaped Genosha” is checked, players may put one of the recorded player side schemes from Scenario #4 into play.</li></ul><br><b>Expert Campaign Only:</b> Set HP/Heal.",
        "resolution": "The players win the campaign!",
        "epilogue": "<i>You escape and wake to find yourself back in your bed at the mansion. Is this really reality or is this just another illusion? Guess we'll just have to find out next time playing Marvel Champions: The Card Game.</i>",
        "image": "mojo_sitcom.jpg"
      }
    ],
    "modulars": {
      "en_sabah_nur": [
        {
          "name": "Clan Akkaba",
          "code": "clan_akkaba"
        },
        {
          "name": "Super Strength",
          "code": "super_strength"
        },
        {
          "name": "Telepathy",
          "code": "telepathy"
        },
        {
          "name": "Flight",
          "code": "flight"
        },
        {
          "name": "Hellfire Club",
          "code": "hellfire"
        }
      ],
      "magneto_villain": [
        {
          "name": "Savage Land",
          "code": "savage_land"
        },
        {
          "name": "Sauron",
          "code": "sauron"
        }
      ],
      "thanos": [
        {
          "name": "Infinity Gauntlet",
          "code": "infinity_gauntlet"
        },
        {
          "name": "Legions of Hydra",
          "code": "legions_of_hydra"
        },
        {
          "name": "Hydra Assault",
          "code": "hydra_assault"
        }
      ],
      "project_wideawake": [
        {
          "name": "Zero Tolerance",
          "code": "zero_tolerance"
        },
        {
          "name": "Dystopian Nightmare",
          "code": "dystopian_nightmare"
        },
        {
          "name": "Genosha",
          "code": "genosha"
        }
      ],
      "mojo": [
        {
          "name": "Sitcom",
          "code": "sitcom"
        },
        {
          "name": "Arcade",
          "code": "arcade"
        }
      ]
    },
    "campaign_notes": [
      "Role",
      "Market or Shawarma",
      "Player Side Scheme"
    ],
    "campaign_counters": [],
    "campaign_checkbox": [
      "Flight",
      "Super Strength",
      "Telepathy",
      "Training Side Scheme Thwarted",
      "Hellfire Club Disbanded",
      "Sauron Encountered",
      "Advanced 1",
      "Advanced 2",
      "The Team Has Gotten Stronger",
      "Escaped Genosha"
    ]
  },
  {
    "code": "revenge_of_the_black_order_by_karl_resch",
    "name": "Revenge of the Black Order",
    "creator": "Karl Resch",
    "description": "The Revenge of the Black Order campaign is made up of three scenarios, all dependent on how the heroes are spending their downtime during a surprise invasion. As the assault intensifies, each group has to tackle different challenges in order to turn the tide of battle and save the day.<br><br><b>Choose your Path:</b><br><ul><li><b>First Response:</b> Identities must possess either the Attorney, Civilian, Genius, Mystic, or Scientist trait.</li><li><b>Spec Ops:</b> Identities must possess either the Android, King, Mercenary, S.H.I.E.L.D., Soldier, Spy, or Wakanda trait.</li><li><b>Direct Assault:</b> Identities must possess either the Asgard, Inhuman, Mutant, or Outlaw trait.</li></ul>",
    "epilogue": "Across the cosmos, the Black Order stands before Thanos. Despite being wounded and battle-scarred, they bear no disappointment, no shame. They stand in silence with steely resolve. They wear their wounds with pride, in an assembly of confidence before the Mad Titan.<br><br>“Sire,” the Ebony Maw states. “We have tested the defenses and seen how the new alliances work together. Earth is now reeling in the confusion and might of what they witnessed.”<br><br>Thanos muses for a moment, nodding his head slowly. “Earth belongs to only one realm,” he says slowly, his voice carrying through the dark emptiness. “Eight other realms lie before us. We begin there, and return to Earth for a final assault.”<br><br>The Maw bows, preparing a portal spell to open the path to the next invasion.",
    "image": "black_order_revenge.jpg",
    "type": "custom",
    "position": 112,
    "scenarios": [
      {
        "code": "venom",
        "name": "Scenario #1A - Krazy Klyntar (First Response)",
        "description": "<i>Nothing beats a day to yourself. Wait, correct that - nothing beats a day to yourself spending it with those closest to you. You have amazing, glorious plans, like reading the book you’ve wanted to at your favorite coffee shop. Maybe spend time with loved ones. Go and grab lunch from your favorite shawarma place. Finally tell your crush your true feelings. So many possibilities on a beautiful day like this.</i><br><br><i>Except the day doesn’t seem so beautiful anymore. The sky is starting to fill with spaceships, descending from the atmosphere, launching fighters and deploying troops. The tranquil silence is broken by screams and sirens. The National Guard begins to descend on the city, telling people to get indoors to safety and declaring martial law. The fear is palpable, which means it’s time to use your gifts to help others, rushing in with the rest of the first responders.</i><br><br><i>It’s no longer a city; it’s a combat zone. The largest transports have landed, deploying hordes of aliens commanded by elite warriors; you recognize them as servants of the Mad Titan, Thanos. Several spaceships with large satellite-discs float above the city; the discs are pointed below at you. Some sort of high-pitched ringing hits your ears, though it’s high enough that it doesn’t seem to be bothering you. You’re just not quite sure what it they are doing.</i><br><br><i>Amidst all the confusion, oily tendril-snakes slither and crawl from sewer drains and outlets, climbing higher and higher to be collected by small flying skiffs deployed from the stationary ships bombarding the city with the unique frequency. You head into the fray, noticing another being moving fast and attempting to gain height above the city - Venom, the lethal protector. You shout his name, but he ignores you, his body twitching strangely. You get closer, only for him to unexpectedly grab and tackle you. You attempt to loosen yourself and fight him off, but he’s in a feral state. He has no words, just mindless savagery. You spy a bell tower on the nearest block, and knock Venom into the area.</i>",
        "introduction": "Each player records their identity in the campaign log. Players cannot switch identities during a campaign.<br>Put the “Metro PD” Support into play.<br>Put the “Save the Shawarma Place” side scheme into play.<br>Each player shuffles a copy of the “Martial Law” obligation into their deck, and records it in the campaign log under “Obligations”.<br>In the campaign log under “Black Order”, mark the “Black Dwarf”, “Supergiant”, and “Black Swan” boxes.<br><br><b>Expert Campaign Only:</b> Place 1 facedown boost card on each identity.<br><br><b>Special Rules:</b> All BLACK ORDER Minions count as having “Victory 1” for this game unless they already possess the Victory X keyword.",
        "resolution": "If Save the Shawarma Place was defeated, mark the “Shawarma” box in the campaign log. For every Black Order Minion in the victory display, unmark the box with their name under the “Black Order” section of the campaign log.<br><br><b>Expert Campaign Only:</b> Record each identity’s remaining hit points.",
        "epilogue": "<i>Venom collapses, stunned and catatonic from the bell’s soundwaves.</i>",
        "image": "venom_klyntar.jpg"
      },
      {
        "code": "tower_defense",
        "name": "Scenario #1B - Defend It and Hope (Spec Ops)",
        "description": "<i>Despite all plans, precautions, and preparations, the attack came without warning. S.W.O.R.D. Command and Alpha Flight Station had no time to retaliate, only issue warnings that a massive fleet was invading Earth’s atmosphere. Many alien armies were sending troops, all being led by Thanos’ Black Order.</i><br><br><i>Your mission briefing was given to you while on your way to deployment. Martial law has been declared, and there are already other friends and allies of yours fighting in the streets against the invaders. You’ve been pulled to another special assignment - protect valuable strongholds and assets while establishing other bases of operations. The obvious first attack is against Avengers Tower, a bastion of defense and knowledge for the superpowers of Earth. The world has descended into chaos, but you have the skills to rise above and protect it.</i>",
        "introduction": "Each player records their identity in the campaign log. Players cannot switch identities during a campaign.<br>Discard cards from the top of the encounter deck until a Setting environment is discarded and put it into play.<br>Put the “Establish Safehouse” player side scheme into play.<br>Shuffle the “Security Breach” side scheme into the Encounter Deck.<br>Place damage on Avengers Tower per the selected difficulty (Standard: 1/player, Expert: 2/player, Heroic: 3/player).<br><br><b>Expert Campaign Only:</b> Record each identity’s remaining hit points in the campaign log.<br><br><b>Special Rules:</b> All BLACK ORDER Minions count as having “Victory 1” for this game unless they already possess the Victory X keyword.",
        "resolution": "If the Avengers Tower has the Damaged trait, mark “Tower Damaged” in the campaign log. If the “Safehouse Established” environment is in play, mark “Safehouse Secured” in the campaign log. If “Security Breach” is in the Victory Display, mark the “Security Breach” box in the campaign log. In the campaign log, mark the “Proxima Midnight” and “Corvus Glaive” boxes under “Black Order”.<br><br><b>Expert Campaign Only:</b> Record each identity’s remaining hit points in the campaign log.",
        "epilogue": "",
        "image": "tower_defense_black_order.jpg"
      },
      {
        "code": "magog",
        "name": "Scenario #1C - Who Will Fight Me? (Direct Assault)",
        "description": "<i>Why is everyone on Earth always so surprised when strange things happen? Parallel universes open up, mythical beings find their ways from other dimensions, and new abilities manifest themselves across humankind. These things happen every day.... so why is everyone freaking out that aliens are attacking from outer space? This isn’t a first.</i><br><br><i>You’re fine with taking the fight to them, up in space - you’ve spent some time up there, after all. If anything, you were kind of getting bored hanging out on Earth anyway. Might as well embrace the strangeness and go where it’s expected.</i><br><br><i>Except getting to your ship isn’t going to be easy. The city is locked down, and you need to access your secret park job. On top of that, it’s not all the Badoon aliens running through the streets, it’s the red alien giant emerging from the sewers and overturning police cars and causing first responders to scatter. You mutter something to yourself about stuff like this happening when universes are absorbed into yours.</i><br><br><i>“Earth shall fall! New masters shall emerge!” the red giant shouts, laughing maniacally. The Badoon give him wide berth, unsure who he fights for. The sound of normal people screaming in fear seems constant. “Where are you, Champions of Earth?” the giant shouts. You step forward, surrounded by alien fighters and civilians looking for safety, a cityscape twisted into some sort of arena. You hear a random person shout out a word of encouragement to you. If only more were filled with hope. Time to make short work of this guy and get up to where the real fight is.</i><br><br><i>As you get ready to rumble, a friend steps forward, assuming a combat stance. “Today’s your lucky day,” he grins at you.</i>",
        "introduction": "Each player records their identity in the campaign log. Players cannot switch identities during a campaign.<br><br><b>Expert Campaign Only:</b> Add one acceleration token to the main scheme.",
        "resolution": "If the Longshot ally is in play, mark the “Scenario 2” box in the “Longshot Ally” section of the campaign log.<br>Each player may choose one support or upgrade they control with a cost of two or less (three or less if The Champion is on its Booing Crowd side) and record it in the campaign log under “Gear Up”. (Each player will be able to start the following scenarios with their chosen card in play at the cost of additional threat on the main scheme.) Players cannot choose cards without a cost.<br><br><b>Expert Campaign Only:</b> Record each identity’s remaining hit points in the campaign log.",
        "epilogue": "<i>As the red giant collapses, the sound of cheering civilians is like music to your ears. It’s nice to be appreciated when you’re so often considered a freak or weirdo. Assembling your allies, you get into your craft and jet through the sky into the atmosphere, blasting your way through enemy fighters.</i>",
        "image": "magog_arena.jpg"
      },
      {
        "code": "brotherhood_of_badoon",
        "name": "Scenario #2 - Badoon Bombardment",
        "description": "More ships fly into view, though these are larger, supporting large cannons. The cannons begin gathering energy, preparing for direct assault!<br><br><b>First Response:</b> <i>Venom collapses, stunned and catatonic from the bell’s soundwaves. The disc-ships hovering above the city begin their ascent back in to space, apparently having collected enough oily tendrils. You’re no longer able to perceive the blasted frequency, whatever it was. It doesn’t seem to be affecting Venom anymore, though you keep the bells ringing just in case. New flagships have arrived, blotting out the sun in an eerie eclipse. You can see large cannons arranging themselves at targets throughout the city, ready to fire, some pointed at safehouses where people have taken cover. Citizens scream in panic, begging you to save them. As the largest ship hovers over the skyline, the hull opens, a new alien commander flying through the sky with a jetpack, flying through the city to attack those caught in the crossfire. You’ve found your next enemy - perhaps if you can stop him, you can prevent more of this assault.</i><br><br><b>Spec Ops:</b> <i>You’d feel a tad more comfortable if you were just dealing with the mindless Outrider soldiers of Thanos, but it seems this time the Black Order has found allies with the Brotherhood of Badoon and the Kree Empire. Disciplined and militaristic, it will take all your strategy to disrupt their plans. The Badoon leader (Drang, according to the newest briefing) seems to have gone back to commanding his fleet, each of them pointing cannons at new strongholds. Kree soldiers take to the streets, moving in precise, tactical formations as they work to eliminate enemies and cover more ground. You defended Avengers Tower; however, it seems like these enemies want to give it another go with more firepower. You can get a transport of your own and do some damage against the fleet while also repulsing the Kree attack. It’s a multi-battlefield fight, but you’re used to the odds stacked against you.</i><br><br><b>Direct Assault:</b> <i>As the red giant collapses, the sound of cheering civilians is like music to your ears. It’s nice to be appreciated when you’re so often considered a freak or weirdo. Assembling your allies, you get into your craft and jet through the sky into the atmosphere, blasting your way through enemy fighters. You see the giant flagship of Drang, leader of the Badoon aliens, positioning his vessel to strike targets below. In the distance, you can see that Drang has retreated from above the city and is now focusing his forces at the Blue Area of the Moon. Apparently, the goal of the Black Order is to try and limit all help your allies can provide. You pilot your craft over to the Blue Area, prepared to help. Your ship is suddenly slammed by an unknown force. Outside, you see Kallark, the Shi’ar Imperial Guard known as Gladiator, giving you a steely look. “I am sorry, my friends,” he shouts to you, “but the Shi’ar Empire is under siege by these invaders. Their terms are that we help in this attack to prevent more of our people being slaughtered.” It looks like you better take care of Drang and get the Imperial Guard back on your side.</i>",
        "introduction": "Follow the instructions for your chosen Campaign Path:<br><br><b>First Response:</b> Put the “Metro PD” Support into play. If “Shawarma” is marked in the campaign log, each player shuffles one copy of “Shawarma” into their deck. Each player shuffles one copy of each obligation recorded in their “Obligation” section of the campaign log along with one copy of the “Panicked Refugees” obligation into their deck. Each player records “Panicked Refugees” in the campaign log under “Obligations”. If “Black Swan” is marked under “Black Order”, put the “Black Swan” minion into play engaged with the first player. If “Supergiant” and/or “Black Dwarf” are marked, shuffle each corresponding minion card(s) into the encounter deck.<br><br><b>Spec Ops:</b> Search the encounter deck for the “Rogue Vessel” environment and put it into play. If “Safehouse Secured” is marked, put the “Safehouse Established” environment into play. Shuffle the “Corvus Glaive” and “Proxima Midnight” minions into the encounter deck. If “Security Breach” is not marked, shuffle the “Security Breach” side scheme into the Encounter Deck. If “Tower Damaged” is marked, deal three damage to each identity.<br><br><b>Direct Assault:</b> One player searches the encounter deck for the Gladiator minion and puts him into play engaged with them. If “Scenario 2” is marked under “Longshot Ally”, one player may put him into play under their control. If not, shuffle the Longshot ally into the encounter deck. Each player may take one copy of the card they recorded in the campaign log from any player’s deck and put it into play under their control. Then, add threat to the main scheme equal to the total cost of the cards put into play this way.<br><br><b>Expert Campaign Only:</b> Set each player’s hit points to their remaining hit point value recorded in the campaign log. (First Response: may add Medical Emergency to heal; Spec Ops: may deal 1 facedown encounter card to heal; Direct Assault: may place 1 acceleration token to heal).",
        "resolution": "For every BLACK ORDER Minion in the victory display, unmark the box with their name under the “Black Order” section of the campaign log.<br><br><b>First Response:</b> If a player removed their copy of “Panicked Refugees” from the game, remove it from the campaign log under “Obligations”.<br><br><b>Spec Ops:</b> If “Security Breach” is in the Victory Display, mark the “Security Breach” box. In the campaign log, mark the “Proxima Midnight” and “Corvus Glaive” boxes under “Black Order”.<br><br><b>Direct Assault:</b> If the Longshot ally is in play, mark the “Scenario 3” box in the “Longshot Ally” in the campaign log.<br><br><b>Expert Campaign Only:</b> Record each identity’s remaining hit points.",
        "epilogue": "",
        "image": "badoon_bombardment.jpg"
      },
      {
        "code": "ebony_maw",
        "name": "Scenario #3 - Mysteries and Magic",
        "description": "The Black Order's nefarious mastermind seems unphased by your victories, emerging into your own section of chaos and entering the fray himself.<br><br><b>First Response (Ground Support):</b> <i>What do they say about the best laid plans? Your perfect day is in shambles. You didn’t get to visit your family, your date fell through, and you cracked your smartphone screen. To top it off, your teammate is bickering with you, and your favorite coffee spot now has a broken alien vessel sitting on the patio. Your world is literally falling apart. No joke, you can’t make this up. You sent the jetpacking alien packing, but now, a portal opens, and Ebony Maw steps through. He stands amongst the rubble and destruction. “Even off guard, you have still managed to perform admirably,” he says, and you’re unsure if he’s stating fact or mocking you. “I can sense your frustration and fear. Perhaps they will remember you with fond memories and forgive you for your failures.” You grit your teeth and think about how this alien is the reason your perfect day got disrupted. Time to go heroic, get Earth back to normal, and salvage what’s left of today.</i><br><br><b>Spec Ops:</b> <i>The second assault has failed. You stand several stories above the city on the landing pad of Avengers Tower. Drang has withdrawn his flagships, ascending into space and vanishing from view. You glance below as the final scuffles finish in the streets. With a whoosh of air, a portal opens, and out steps another member of the Black Order, Ebony Maw. While looking slightly battered, his demeanor is calm, collected, and smug. “Despite all your tactics and military might, you lack understanding of true strength. Behold, the mysteries of the universe.” He gestures wildly, his fingers twisting as he weaves complex sorcery. The aura around him darkens, and portals begin to open around him as he summons creatures not native to this realm. Extraterrestrial horrors emerge all around you, some swarming down to the city streets below. “No training can prepare you for this,” he says with a cold stoicism. He’s not wrong, you think to yourself. You wish you had a wizard with you to assist in all this wizarding madness.</i><br><br><b>Direct Assault:</b> <i>A portal opens, and a wounded Maw steps through. You can see the cityscape of Earth behind him. He pauses a moment and breathes deeply, and you see oily tendrils creep along his arms, his long fingers morphing into claws. “A world full of Klyntar remnants should have been more responsible about their handling,” he muses. “It only takes one enemy to suddenly turn them against you.” As he smiles, you notice his features partially transformed with razor-sharp teeth. Gesturing wildly, the Maw begins to open portals around him, bringing forth wondrous and mysterious creatures of the cosmos and other worlds. A deep, guttural, Klyntar-infused laugh emanates from his mouth.</i>",
        "introduction": "Follow the setup for your Campaign Path:<br><br><b>First Response:</b> Put the “Metro PD” Support into play. If “Shawarma” is marked in the campaign log, each player shuffles one copy of “Shawarma” into their deck. If “Black Swan” is marked under “Black Order”, put the “Black Swan” minion into play engaged with the first player. If “Supergiant” and/or “Black Dwarf” are marked, shuffle each corresponding minion card(s) into the encounter deck. Search the encounter deck for the “Mojo in the Middle” environment and put it into play.<br><br><b>Spec Ops:</b> If “Safehouse Secured” is marked, put the “Safehouse Established” environment into play. If “Security Breach” is not marked, shuffle the “Security Breach” side scheme into the encounter deck. If “Corvus Glaive” and/or “Proxima Midnight” are marked, shuffle each corresponding minion card(s) into the encounter deck. If “Tower Damaged” is marked, deal three damage to each identity.<br><br><b>Direct Assault:</b> If “Scenario 3” is marked under “Longshot Ally”, one player may put him into play under their control. If not, shuffle the Longshot ally into the encounter deck. Each player may take one copy of the card they recorded in the campaign log from any player’s deck and put it into play under their control. Then, add threat to the main scheme equal to the total cost of the cards put into play this way.<br><br><b>Expert Campaign Only:</b> Set each player’s hit points to their remaining hit point value recorded in the campaign log. (First Response: may add Medical Emergency/Obligations to heal; Spec Ops: may deal 1 facedown encounter card to heal; Direct Assault: may place 1 acceleration token to heal).",
        "resolution": "For every BLACK ORDER Minion in the victory display, unmark the box with their name under the “Black Order” section of the campaign log.",
        "epilogue": "<b>First Response:</b> <i>The negative emotions you’ve felt today are gone. A mix of righteous rage and adrenaline courses through your veins as you prepare to end Ebony Maw. With a single incantation, a portal opens and he falls through, disappearing. Soon after, the remaining spaceships begin to disperse, clearing the sky once again. It takes a moment to calm down, and you walk to your favorite coffee shop and deal with the alien debris. People being to emerge from their hiding places, looking to assist and thanking you for being there to save them. Perhaps things aren’t as bad as they seemed. You sigh, and look at your broken phone screen. Might as well try and make that phone call now. You can’t shake the feeling that something grows beyond the stars. The Black Order has new allies, and they all sought to go to war with Earth. What can it mean?</i><br><br><b>Spec Ops:</b> <i>The final briefing on the events of the day led to more questions than answers. The whole world was attacked strategically, but certain defenses pertaining to the superhuman community seemed to be the target. While the attacks were brutal and aggressive, once tough resistance was met, the troops withdrew. Numerous places were attacked, some of which previously housed items of power or resources like vibranium and adamantium. Reports, however, show that once defenders like you were deployed to the most valuable areas, the other assaults withdrew. The focus was entirely on what would be defended. You can’t help but feel a growing sense of unease. All that’s left is disarray and questions. It seems as if the Black Order was after information....to see what the response to an invasion would be.</i><br><br><b>Direct Assault:</b> <i>As the Maw staggers, he waves a hand, opening a portal and stepping through it before you can do anything else. The ships around you begin to retreat. The Imperial Guard, renewed at your victory, begin attacking the vessels that are retreating slowly. As the horizon empties to nothing but stars and empty space, Gladiator returns to you, carrying a Badoon prisoner. “You need to hear this from him,” he says, then throws the warrior at your feet. Despite the defeat, the alien is calm, almost dignified. “The Shi’ar Empire is weakened,” he rasps. “Earth is unstable. This victory is only temporary. How can you believe yourselves so well-protected when an interstellar army assembles? Too much power resides here, and others have taken note. Alliances are forming.” Gladiator takes him away, gathering the rest of the Imperial Guard to depart. A growing unease gnaws at you - what was learned?</i>",
        "image": "ebony_maw_final.jpg"
      }
    ],
    "modulars": {
      "venom": [
        {
          "name": "Symbiotic Strength",
          "code": "symbiotic_strength"
        },
        {
          "name": "Black Order",
          "code": "black_order"
        }
      ],
      "tower_defense": [
        {
          "name": "Streets of Mayhem",
          "code": "streets_of_mayhem"
        }
      ],
      "magog": [
        {
          "name": "Band of Badoon",
          "code": "band_of_badoon"
        },
        {
          "name": "Longshot",
          "code": "longshot"
        }
      ],
      "brotherhood_of_badoon": [
        {
          "name": "Flight",
          "code": "flight"
        },
        {
          "name": "Kree Militants",
          "code": "kree_militant"
        },
        {
          "name": "Blue Moon",
          "code": "blue_moon"
        }
      ],
      "ebony_maw": [
        {
          "name": "Sitcom",
          "code": "sitcom"
        },
        {
          "name": "Telepathy",
          "code": "telepathy"
        },
        {
          "name": "Legions of Hel",
          "code": "legions_of_hel"
        },
        {
          "name": "Menagerie Medley",
          "code": "menagerie_medley"
        },
        {
          "name": "Symbiotic Strength",
          "code": "symbiotic_strength"
        }
      ]
    },
    "campaign_notes": [
      "Story Path",
      "Gear Up",
      "Obligations",
      "Narrative Campaign Restrictions"
    ],
    "campaign_counters": [],
    "campaign_checkbox": [
      "Black Dwarf",
      "Supergiant",
      "Black Swan",
      "Proxima Midnight", 
      "Corvus Glaive",
      "Shawarma",
      "Tower Damaged",
      "Safehouse Secured",
      "Security Breach",
      "Scenario #2 - Longshot Ally",
      "Scenario #3 - Longshot Ally"
     ]
  },
  {
    "code": "she_hulk_vs_deadpool_game_night_by_kurt_hake",
    "name": "She-Hulk vs. Deadpool’s Game Night",
    "creator": "Kurt Hake",
    "description": "This campaign is a story about the rivalry between everyone's favorite fourth-wall breakers: She-Hulk and Deadpool. Deadpool has set up a series of metagame challenges to prove who is better at card games. Players take She-Hulk's side to navigate the unpredictable chaos of the 'Pool aspect.<br><br><b>Requirements:</b> One player must be She-Hulk. Other players must be Avengers or X-Force (but not Deadpool).",
    "epilogue": "<i>Free from The Collector's game boxes, the heroes head home. Both Avengers and X-Force are careful to keep the reclaimed Reality Stone away from Deadpool. Seemingly oblivious to the anger of his teammates, he begins to celebrate.<br><br>\"This team-up campaign of ours was fun. Maybe we should make the merger permanent. How about name blending? The A-Force has a nice ring to it.\"<br><br>She-Hulk quickly shoots down the idea. \"Deadpool, the players may have had some fun, but I'm never working with you again. Besides, I've already led a team called A-Force. If you steal the name, I'll sue, and you know that lawfare is a game you'll never beat me in.\"</i>",
    "image": "game_night.jpg",
    "type": "custom",
    "position": 113,
    "scenarios": [
      {
        "code": "red_skull",
        "name": "Scenario #1 - Game Night Begins",
        "description": "<i>With the power of the Reality Stone, Red Skull begins to remake the world in his own image. In response, the Avengers assemble at their mansion to make plans to take down their old foe.<br><br>She-Hulk expresses doubt in their chances. “This seems like an awfully difficult scenario for beginning a campaign. What was the designer thinking?”<br><br>The other Avengers look at each other perplexed, but their confusion is interrupted by the mansion doorbell. To their surprise, the X-Force is at the door! Deadpool struts in and tries to take charge. “I know how to take down the Red Skull, because I have a double agent inside Hydra! Follow me, and I bet the players will win before scheme 1B is even complete.”<br><br>She-Hulk isn’t having it. “Deadpool, nobody put you in charge. Everybody knows I’m better than you at games, especially Marvel Champions. And if you are so confident you know how to win, why do you need our help?”<br><br>Without warning, Reavers crash through the windows into the mansion. Their leader, Lady Deathstrike, joins the conversation as though she were invited. “He must want your help because he’s afraid of me! The Red Skull may be fanatical, but we Reavers would hunt these mutants even if Hydra weren’t offering a reward.”</i>",
        "introduction": "Each player records their AVENGER or X-FORCE hero identity in the campaign log.<br>The first player searches their collection for the Deadpool ally (Next Evolution #24) and puts it into play.<br>She-Hulk searches her collection for the War upgrade (Deadpool Hero Pack #58) and shuffles it into her deck.<br>She-Hulk must search the encounter deck for the Lady Deathstrike minion, and then deal it to herself as a facedown encounter card.<br><br><b>Special Rules:</b><br>Deadpool gains the following text: “The first player controls Deadpool. Deadpool does not count against your ally limit. If Deadpool leaves play, the players lose the game.”<br>The METAGAME challenge is to defeat a REAVER minion using the War upgrade.<br>The teamwork goal is simply to win the scenario.",
        "resolution": "<b>Scenario resolution:</b><br>Remove Deadpool and War from the player decks.<br>In the campaign log:<br><ul><li>Add Blackout and War (Deadpool Hero Pack #53, 58) to the Reward Pool.</li><li>If the METAGAME challenge was completed, add “War” to Games Won for She-Hulk. Otherwise, add “War” to Games Won for Deadpool.</li></ul><br><b>Victory:</b><br>In the campaign log:<br><ul><li>Because you won the scenario, you completed the teamwork goal. Add 1 to the Strength of the Alliance.</li><li>Deadpool has rewards for you. Add Stick-to-itiveness and Laser Swords (Deadpool Hero Pack #30, 55) to the Reward Pool.</li></ul><br><b>Defeat:</b><br>Because you lost the scenario and had to be rescued by Bob, Deadpool has pity on you. In the Campaign Log, add Git Gud and Bob, Agent of Hydra (Deadpool Hero Pack #28, 43) to the Reward Pool.",
        "epilogue": "<b>Victory:</b> <i>Red Skull is defeated, and She-Hulk confiscates the Reality Stone, returning the world to normal. \"Once we lock the stone away for safekeeping, do you X-Force guys want to join us for shawarma? It's an Avengers tradition.\" Although the idea sounds good to both teams, Deadpool shakes his head. \"Why settle for shawarma when we have an Infinity Stone to play with?\" Before She-Hulk can react, Deadpool steals the Reality Stone.</i><br><br><b>Defeat:</b> <i>Just as Red Skull is about to achieve total victory, he is blasted in the back by one of his own Hydra goons! It must be the double agent that Deadpool mentioned. Deadpool takes the opportunity to swipe the Reality Stone. \"Nice job, Bob! Old no-nose never saw you coming. With this Infinity Stone, I could return the world to normal - but that would be boring! Let's have some fun with it instead.\"</i>",
        "image": "red_skull_game.jpg"
      },
      {
        "code": "four_horsemen",
        "name": "Scenario #2 - The Lord of the Wings",
        "description": "<i>Deadpool transforms the heroes' surroundings into a strange fantasy world. “The players already know that I’m the best at Marvel Champions, but with the Reality Stone I can prove that I’m the best at everything. Welcome to the Lord of the Wings!”<br><br>As if on cue, the winged monsters Sauron and Death descend on the heroes. She-Hulk is angry. “That Deadpool! He’s just jealous that I got to be in the Core Set. I’m going to show him who’s really the best at card games. OK, players, it’s time to start the scenario. Better play your cards right!”</i>",
        "introduction": "Beginning with the first player, deal the contents of the Reward Pool at random to the players. Each player shuffles their dealt cards into their deck without looking at them.<br>The first player must search the encounter deck for the A Game of Mojo's environment and the Sauron Lives! side scheme, and then put them into play.<br><br><b>Special Rules:</b><br>In this scenario, all minions gain the Villainous keyword.<br>The METAGAME challenge is to confuse the Death villain using the Blackout upgrade.<br>The teamwork goal is for each player to have an X-FORCE ally in play when the scenario ends.<br><br><b>Strength of the Alliance:</b><br>0: No Effect.<br>1: The first time each player plays a ‘Pool card each round, that player may draw a card.<br>2: Each identity gets +2 hit points.<br>3: Each AVENGER character gains the X-FORCE trait, and vice versa.<br>4: Increase each player’s ally limit by 1.<br>5: Each HYDRA, POSSE, or DEADPOOL CORPS ally gains the AVENGER and X-FORCE traits.<br>6: While Collector is WOUNDED, he is not given boost cards.<br>7: Whenever the Milano is exhausted, the first player may ready Deadpool.<br>8: Each hero has +1 THW for each Time Stone Rewind in the campaign log.",
        "resolution": "<b>Scenario resolution:</b><br>Remove all 'Pool cards from player decks and return them to the Reward Pool.<br>In the campaign log:<br><ul><li>Add Tic-Tac-Toe (Deadpool Hero Pack #57) to the Reward Pool.</li><li>If the METAGAME challenge was completed, add “Blackout” to Games Won for She-Hulk. Otherwise, add “Blackout” to Games Won for Deadpool.</li><li>If the teamwork goal was completed, add 1 to the Strength of the Alliance.</li></ul><br><b>Victory:</b><br>In the campaign log:<br><ul><li>Add \"Lord of the Wings\" to Games Won for She-Hulk.</li><li>Each player selects a different card from this list and adds it to the Reward Pool: Cutupper, Get Rage-y, Not My Responsibility, Get in Front of Me!, Plot Convenience.</li></ul><br><b>Defeat:</b><br>In the campaign log, add \"Lord of the Wings\" to Games Won for Deadpool.",
        "epilogue": "<b>Victory:</b> <i>She-Hulk stands triumphant. \"Come on, Deadpool. I've already beaten you. Give up the stone!\" \"I don't think so. The players were promised a full campaign, and I'm sure I'll beat you in the next game!\"</i><br><br><b>Defeat:</b> <i>After the heroes fail to take down the Horsemen, Deadpool uses the Infinity Stone to defeat the villains. He taunts She-Hulk for her loss. \"Ha! You're so bad at this game. Let's play another!\"</i>",
        "image": "fantasy_deadpool.jpg"
      },
      {
        "code": "risky_business",
        "name": "Scenario #3 - Android Web-Hacker",
        "description": "<i>With Sauron and the Horsemen defeated, Deadpool again uses the Reality Stone. Before anyone can stop him, the fantasy world is replaced with a dystopian futuristic cityscape. “It’s time for the next game!” Deadpool shouts. “I’ll take down this evil corporation and prove I’m the best at Android Web-hacker!”<br><br>She-Hulk smirks. “I’ve taken down crooked corporate types in the court room before. This time it’ll be fun to use my fists. Hey, players, you should put some ANDROID allies in your decks. They’ll be helpful in hacking the corporate systems.”</i>",
        "introduction": "Deal the Reward Pool at random. Search the encounter deck for the Mojo Runner environment and the ICE-teroid M side scheme and put them into play.<br><br><b>Special Rules:</b><br>Whenever the Criminal Enterprise environment enters play, place an ice counter on each scheme. If a scheme with an ice counter would have any amount of threat removed, prevent all of that removal and discard an ice counter from it instead.<br>When an ANDROID character thwarts, discard all ice counters from the target before removing threat.<br>The METAGAME challenge is to defeat a PROGRAM minion using the Tic-Tac-Toe upgrade.<br>The teamwork goal is for each player to have an AVENGER ally in play when the scenario ends.<br><br><b>Strength of the Alliance:</b><br>0: No Effect.<br>1: The first time each player plays a ‘Pool card each round, that player may draw a card.<br>2: Each identity gets +2 hit points.<br>3: Each AVENGER character gains the X-FORCE trait, and vice versa.<br>4: Increase each player’s ally limit by 1.<br>5: Each HYDRA, POSSE, or DEADPOOL CORPS ally gains the AVENGER and X-FORCE traits.<br>6: While Collector is WOUNDED, he is not given boost cards.<br>7: Whenever the Milano is exhausted, the first player may ready Deadpool.<br>8: Each hero has +1 THW for each Time Stone Rewind in the campaign log.",
        "resolution": "<b>Scenario resolution:</b><br>Remove all 'Pool cards from player decks and return them to the Reward Pool.<br>In the campaign log:<br><ul><li>Add Rock, Paper, Scissors (Deadpool Hero Pack #56) to the Reward Pool.</li><li>If the METAGAME challenge was completed, add “Tic-Tac-Toe” to Games Won for She-Hulk. Otherwise, add “Tic-Tac-Toe” to Games Won for Deadpool.</li><li>If the teamwork goal was completed, add 1 to the Strength of the Alliance.</li></ul><br><b>Victory:</b><br>In the campaign log:<br><ul><li>Add \"Android Web-hacker\" to Games Won for She-Hulk.</li><li>Each player selects a different card from this list and adds it to the Reward Pool: Da Bomb, 'Pool Inspection, Self Confidence, Self Control, Self Preservation.</li></ul><br><b>Defeat:</b><br>In the campaign log, add \"Android Web-hacker\" to Games Won for Deadpool.",
        "epilogue": "<b>Victory:</b> <i>She-Hulk celebrates the win. \"Have you had enough, Deadpool, or do I need to beat you again?\" \"Not even close! Hacking was never my specialty anyway. Let's see if you can keep your sanity in the next game! We've got time for at least one more before the buyer arrives.\"</i><br><br><b>Defeat:</b> <i>Deadpool defeats the Green Goblin, gloating all the way. \"She-Hulk was talking so big, but little old Wade is the winner! I can't wait to play another game. As Cap would say, I can do this all day. Or, at least I can do this until the buyer shows up.\"</i>",
        "image": "cyberpunk_hacker.jpg"
      },
      {
        "code": "en_sabah_nur",
        "name": "Scenario #4 - Akkaba Horror",
        "description": "<i>Reality transforms once again, but this time it grows dark. The heroes find themselves inside a foul and spooky chamber where some sort of cult ritual is taking place. Deadpool remains disturbingly cheerful. “It’s time to play Akkaba Horror! Try not to lose your mind - though, in my opinion, sanity is overrated anyway.”</i>",
        "introduction": "Deal the Reward Pool. Search the encounter deck for the Mojo Files environment and the Cultist minion and put them into play. Place 3 sanity counters on each identity.<br><br><b>Special Rules:</b><br>Whenever a player reveals a Treachery card, that player must discard a sanity counter from their identity. If an identity ever has no sanity counters, that identity is defeated.<br>The METAGAME challenge is to add an aspect card to hand using the Rock, Paper, Scissors upgrade.<br>The teamwork goal is for each player to have 2 or more sanity counters when the scenario ends.<br><br><b>Strength of the Alliance:</b><br>0: No Effect.<br>1: The first time each player plays a ‘Pool card each round, that player may draw a card.<br>2: Each identity gets +2 hit points.<br>3: Each AVENGER character gains the X-FORCE trait, and vice versa.<br>4: Increase each player’s ally limit by 1.<br>5: Each HYDRA, POSSE, or DEADPOOL CORPS ally gains the AVENGER and X-FORCE traits.<br>6: While Collector is WOUNDED, he is not given boost cards.<br>7: Whenever the Milano is exhausted, the first player may ready Deadpool.<br>8: Each hero has +1 THW for each Time Stone Rewind in the campaign log.",
        "resolution": "<b>Scenario resolution:</b><br>Remove all 'Pool cards from player decks and return them to the Reward Pool.<br>In the campaign log:<br><ul><li>If the METAGAME challenge was completed, add “Rock, Paper, Scissors” to Games Won for She-Hulk. Otherwise, add “Rock, Paper, Scissors” to Games Won for Deadpool.</li><li>If the teamwork goal was completed, add 1 to the Strength of the Alliance.</li></ul><br><b>Victory:</b><br>In the campaign log:<br><ul><li>Add \"Akkaba Horror\" to Games Won for She-Hulk.</li><li>Each player selects a different card from this list and adds it to the Reward Pool: Dogpool, Headpool, Kidpool, Lady Deadpool, Pandapool.</li></ul><br><b>Defeat:</b><br>In the campaign log, add \"Akkaba Horror\" to Games Won for Deadpool.",
        "epilogue": "<b>Victory:</b> <i>Although the heroes are victorious against Clan Akkaba, She-Hulk is not happy. \"This has gone far enough, Deadpool! We've all had enough of these games.\" The world returns to normal as Deadpool seemingly relents. \"You're right. It's time for the games to end, because my buyer is here!\" The feeling of dread returns to the heroes as a huge spaceship fills the sky.</i><br><br><b>Defeat:</b> <i>Though the heroes are overwhelmed by Clan Akkaba, Deadpool uses the power of the stone to defeat the cultists and return En Sabah Nur to his slumber. \"I win! It's too bad we're out of time. These games have been fun, but my buyer has arrived, and a merc has got to get paid.\" Reality begins to return to normal, but despite the familiar surroundings, a foreboding spaceship flies into view.</i>",
        "image": "apocalypse_horror.jpg"
      },
      {
        "code": "escape_the_museum",
        "name": "Scenario #5 - The Game Collection",
        "description": "<i>Deadpool turns on the heroes, using the Reality Stone to trap them in cells resembling giant game boxes. He loads the boxes onto the ship, revealing his buyer to be none other than Taneleer Tivan, The Collector.<br><br>The Collector is very pleased. “What a bargain! Not only have I acquired an Infinity Stone, but I also get several new games out of the deal! With these new additions, my game collection will be unrivaled.”<br><br>Within moments, the captured heroes find themselves warping through space to The Collector’s Museum. When they arrive, The Collector places them on a giant shelf, doomed to live like pawns on a board or cards in a deck.<br><br>She-Hulk is not going quietly. “That rat Deadpool! After endangering the very fabric of reality all night, he turns us over to a mad cosmic being for thirty pieces of silver. I mean, we both know the campaign needed a fifth scenario, but it didn’t have to be like this. How can you X-Force guys stand to work with him?”<br><br>But just then, Deadpool appears. “Hey, give me a break. I always planned on breaking you out. Besides, a mercenary has to make his money somehow. Do you have any idea what kind of wealth an Elder of the Universe can offer?”<br><br>“Deadpool, if we manage to get out of this, my fists and your face are going to have a long chat.”<br><br>“Oh, come on, don’t act like you haven’t had fun. Everybody loves a good card game. We’ll get the Reality Stone back, find a ship, and escape. I promise I’ll play nice.”</i>",
        "introduction": "Deal the Reward Pool. Put the Deadpool ally into play.<br>If there are 4 or more Games Won for She-Hulk, she won the majority of the games. As a reward, add 1 to the Strength of the Alliance.<br>While constructing the encounter deck, for each Game Won for Deadpool, trigger the corresponding penalty (adding modular sets or revealing side schemes).<br>She-Hulk deals herself the Card Shark minion.<br><br><b>Strength of the Alliance:</b><br>0: No Effect.<br>1: The first time each player plays a ‘Pool card each round, that player may draw a card.<br>2: Each identity gets +2 hit points.<br>3: Each AVENGER character gains the X-FORCE trait, and vice versa.<br>4: Increase each player’s ally limit by 1.<br>5: Each HYDRA, POSSE, or DEADPOOL CORPS ally gains the AVENGER and X-FORCE traits.<br>6: While Collector is WOUNDED, he is not given boost cards.<br>7: Whenever the Milano is exhausted, the first player may ready Deadpool.<br>8: Each hero has +1 THW for each Time Stone Rewind in the campaign log.",
        "resolution": "<b>Victory:</b><br>The players win the campaign!<br><br><b>Defeat:</b><br>In the campaign log, add 1 to the number of Time Stone Rewinds. Remove all 'Pool cards from player decks and return them to the Reward Pool. Replay this scenario. (You may alter your deck first.) Do NOT reset the Strength of the Alliance to what it was before the scenario was set up.",
        "epilogue": "<b>Defeat:</b> <i>The escape has failed. It seems the heroes will spend the rest of their lives as pieces of The Collector's games. But what's that shiny green object in Deadpool's hand? \"I think our team-up is in need of a little deus ex machina. It's a good thing the Reality Stone wasn't my only Infinity Stone!\" he shouts. \"With the Time Stone, I can reset the scenario. You're welcome, players! Just remember it was me, not She-Hulk, who saved the day.\"</i>",
        "image": "collector_museum.jpg"
      }
    ],
    "modulars": {
      "red_skull": [
        {
          "name": "Deathstrike",
          "code": "deathstrike"
        },
        {
          "name": "Reavers",
          "code": "reavers"
        }
      ],
      "four_horsemen": [
        {
          "name": "Sauron",
          "code": "sauron"
        },
        {
          "name": "Fantasy",
          "code": "fantasy"
        }
      ],
      "risky_business": [
        {
          "name": "Sci-Fi",
          "code": "sci-fi"
        }
      ],
      "en_sabah_nur": [
        {
          "name": "Clan Akkaba",
          "code": "clan_akkaba"
        },
        {
          "name": "Horror",
          "code": "horror"
        }
      ],
      "escape_the_museum": [
        {
          "name": "Galactic Artifacts",
          "code": "galactic_artifacts"
        },
        {
          "name": "Ship Command",
          "code": "ship_command"
        },
        {
          "name": "Western",
          "code": "western"
        },
        {
          "name": "Flight",
          "code": "flight"
        },
        {
          "name": "Telepathy",
          "code": "telepathy"
        },
        {
          "name": "Super Strength",
          "code": "super_strength"
        }
      ]
    },
    "campaign_notes": [
      "Reward Pool",
      "Games Won For She-Hulk",
      "Games Won For Deadpool"
    ],
    "campaign_counters": [
      "Strength Of The Alliance",
      "Time Stone Rewinds"
    ]
  },
  {
    "code": "watcher_team_what_if_by_zach_goscha",
    "name": "The Watcher’s Team: What If...?",
    "creator": "Zach Goscha",
    "description": "I am The Watcher. I observe many realities beyond the one you know. In this campaign, we explore unique stories where heroes are not who they seem. You will be forced to change identities to witness these vast changes across the multiverse.",
    "epilogue": "<i>I am The Watcher. It was my job to record every single reality and to simply watch the multiverse unfold. I have watched the choices in your reality and the universe you call Marvel Champions. But I will no longer simply watch. If a new evil arises that will shape and change the multiverse for the worse, I will call on unique heroes to save the day. I will strive to save as many as I can as we both continue to explore the vast new realities and ask ourselves the question... What If...?</i>",
    "image": "watcher_what_if.jpg",
    "type": "custom",
    "position": 114,
    "scenarios": [
      {
        "code": "ebony_maw",
        "name": "Scenario #1 - Iron Man: Trapped In Time",
        "description": "<i>I am The Watcher and in the reality you play, Iron Man is a TECH upgrade-focused hero. But there are more realities than one, and I must watch them all. In this world, represented by what you call a scenario, Tony Stark finds himself in a fantasy environment. A powerful wizard is after a special gem located in one of the grand cities, using an array of dragons and frost giants to succeed we must answer the question: What if Iron Man was Trapped In The Time of King Arthur?</i>",
        "introduction": "Iron Man must be one of the identities used.<br>One copy of Godslayer (Gamora #18) is added to Iron Man’s deck regardless of which aspect the Iron Man player picked. Godslayer adds the Setup and Permanent keywords to the card.<br>To advance to each villain phase, Godslayer must be used in the attack that reduces the villain to zero hit points.<br>Shuffle System Shock into the encounter deck.",
        "resolution": "If the Dragon minion was defeated, each player gains: “Endless Possibilities” - During step 15 of the game setup, each player may take 1 additional mulligan.<br><b>Expert Campaign Only:</b> Record Iron Man's remaining hit points in the campaign log.",
        "epilogue": "<i>Iron Man is victorious over the wizard! He grabs the gem the villain was after, but the wizard has one last trick up his sleeve. Ebony Maw casts a portal spell that sucks Iron Man away to another realm.</i>",
        "image": "king_arthur_ironman.jpg"
      },
      {
        "code": "stryfe",
        "name": "Scenario #2 - Spider-Man: The Sorcerer Supreme",
        "description": "<i>I am The Watcher and in the reality you play, Spider-Man is simply a web-swinging Avenger. But there are more realities than one, and I must watch them all. In this world, represented by what you call a scenario, Peter Parker is more than a genius, he is in fact a mystic. Leaving behind street crime he faces down a villain from the future in a paranormal setting. On a mission to save Hope Summers from a time traveling villain, the wall-crawler fights to save the entire universe as we answer the question: What if Spider-Man was the Sorcerer Supreme?<br><br>Wait, what’s this? As a portal opens revealing a knight in red and gold armor. Iron Man emerges from the portal, in a new realm and reality. Not sure where he is he nonetheless jumps into action helping the Sorcerer Supreme.</i>",
        "introduction": "Spider-Man (Peter Parker) must be used and gains the Mystic trait. Add The Sorcerer Supreme to his deck with Setup and Permanent keywords.<br>Players must also use the Iron Man identity from the previous scenario.<br>Deal Black Tom Cassidy as a facedown encounter card to Spider-Man.<br><b>Expert Campaign Only:</b> If Iron Man is in play, set Iron Man's hit point value recorded in the campaign log for the previous scenario. The Iron Man player may deal themselves 1 facedown encounter card to heal their identity to its full hit point value.",
        "resolution": "If the Spider-Man/Peter Parker player used a card with a SPELL trait to reduce Stryfe to 0 hit points, each player gains: “Cosmic Sight” - After step 15 of the game setup, each player may search their discard pile and deck for a resource card and add it to their hand.<br><b>Expert Campaign Only:</b> Record Spider-Man and Iron Man's remaining hit points in the campaign log.",
        "epilogue": "<i>Spider-Man senses a huge level of danger coming from the Underworld and plunges into the rift with Iron Man following close behind.</i>",
        "image": "sorcerer_supreme_spiderman.jpg"
      },
      {
        "code": "hela",
        "name": "Scenario #3 - Rogue And The Power Of Thor",
        "description": "<i>I am The Watcher and in the reality you play, Rogue is a member of the X-Men. But there are more realities than one, and I must watch them all. In this world, represented by what you call a scenario, Anna Marie is a god. Fighting to vanquish the villains that would harm Asgard and to save Odin from Hel, we explore the unique question: What if Rogue posessed the power of Thor?<br><br>As Rogue enters Hel wielding Jarnbjorn, in search of Odin, a portal opens up. Rogue turns, ready to attack only to see heroes emerge, Spider-Man, the Sorceror Supreme, and Iron Man, a knight of King Arthur’s court. After explaining her plan, the heroes agree to help Rogue save Odin, if only to find out why they sense a high level of cosmic danger.</i>",
        "introduction": "Rogue must be used and gains the Asgard trait. Add Jarnbjorn to her deck with Setup and Permanent keywords.<br>Players must also select either Iron Man or Spider-Man from the previous scenarios.<br>Search the encounter discard pile and deck for an Attachment and attach it to the villain.<br><b>Expert Campaign Only:</b> Set HP/Heal for Iron Man/Spider-Man.",
        "resolution": "If Hela was flipped to her Wounded side 4 or more times, each player gains: “A Portal In Times Of Need” - After step 15 of the game setup, each player may search their discard pile and deck for an ally and add it to their hand.<br><b>Expert Campaign Only:</b> Record Rogue, Spider-Man (Peter Parker), and Iron Man's remaining hit points in the campaign log.",
        "epilogue": "<i>The Watcher reveals himself to the heroes, warning of a great and terrible enemy at hand.</i>",
        "image": "thor_rogue.jpg"
      },
      {
        "code": "the_hood",
        "name": "Scenario #4 - Captain America: Vigilante Justice",
        "description": "<i>I am The Watcher and in the reality you play, Captain America is a shield-wielding protector of the people. But there are more realities than one, and I must watch them all. In this world, represented by what you call a scenario, Steve Rogers has taken on the role of an aggressive vigilante, tearing through street level crime with lots of weapons and little mercy. Through this, we discover: What if Captain America was a hotblooded, lethal protector?<br><br>In a dark and dirty alleyway, we see our hero, wearing red, white, and blue, yet bearing a dark expression. In the same alleyway, my portal opens bringing with it the heroes I have gathered. While wanting nothing to do with the other heroes, this new Captain America reluctantly decides to help them if first they help him vanquish an evil villain known only as The Hood.</i>",
        "introduction": "Captain America must be used and gains the Civilian trait. His deck must include at least 6 cards with the Weapon trait.<br>Add Lock and Load and Laser Cannon to his deck.<br>Each player must either take 2 indirect damage, place 2 threat on the main scheme or discard 2 cards at random.<br><b>Expert Campaign Only:</b> Set HP/Heal for previous identities.",
        "resolution": "If at least 5 minions were defeated with a card that has the WEAPON trait, each player gains: “I Have Intervened” - After step 15 of the game setup, each player may search their discard pile and deck for an identity-specific card and add it to their hand.<br><b>Expert Campaign Only:</b> Record each hero's remaining hit points in the campaign log.",
        "epilogue": "<i>The Watcher informs the four unique heroes that the fate of the universe is in their hands as he transports them to the final battle.</i>",
        "image": "vigilante_captain_america.jpg"
      },
      {
        "code": "ultron",
        "name": "Scenario #5 - The Watcher’s Team",
        "description": "<i>I have been watching this entire time. The defeat of each villain, the unique story of each hero, and conquest or defeat of the many timelines I witness. I have seen your victories and defeats. I have seen the unique worlds you visit, the vast changes of identities, aspects, villains, and encounters that each one experiences. But I will not be silent anymore. I will not watch another entire world end because I am only watching. I have intervened and I will watch no more. We will now explore a new question that has never been asked before: What if The Watcher intervened?<br><br>In this unique timeline, Ultron has gained the Infinity Gauntlet. In his quest for power, Ultron will destroy this planet using nuclear codes. Soon, nobody will be able to stand up to him, and the android will destroy countless worlds the same way. I have gathered the most unique and powerful heroes from across the multiverse to defeat the villain once and for all. I have intervened.</i>",
        "introduction": "Players must select identities used in the previous scenarios and follow their unique setup rules.<br>For each player, draw and reveal a card from the Infinity Stone deck.<br><b>Expert Campaign Only:</b> Set HP/Heal.",
        "resolution": "Ultron is defeated and the players win the campaign!",
        "image": "ultron_gauntlet.jpg"
      }
    ],
    "modulars": {
      "ebony_maw": [
        {
          "name": "Fantasy",
          "code": "fantasy"
        },
        {
          "name": "Frost Giants",
          "code": "frost_giants"
        }
      ],
      "stryfe": [
        {
          "name": "Hope Summers",
          "code": "hope_summers"
        },
        {
          "name": "Horror",
          "code": "horror"
        },
        {
          "name": "Black Tom Cassidy",
          "code": "black_tom_cassidy"
        }
      ],
      "hela": [
        {
          "name": "Legions of Hel",
          "code": "legions_of_hel"
        },
        {
          "name": "Enchantress",
          "code": "enchantress"
        }
      ],
      "the_hood": [
        {
          "name": "Streets of Mayhem",
          "code": "streets_of_mayhem"
        },
        {
          "name": "Zzzax",
          "code": "zzzax"
        },
        {
          "name": "Ransacked Armory",
          "code": "ransacked_armory"
        },
        {
          "name": "Running Interference",
          "code": "running_interference"
        },
        {
          "name": "Down To Earth",
          "code": "down_to_earth"
        },
        {
          "name": "Weapon Master",
          "code": "weap_master"
        },
        {
          "name": "Iron Spider's Sinister Six",
          "code": "ironspider_sinister"
        }
      ],
      "ultron": [
        {
          "name": "Infinity Gauntlet",
          "code": "infinity_gauntlet"
        }
      ]
    },
    "campaign_notes": [],
    "campaign_counters": [],
    "campaign_checkbox": [
      "Endless Possibilities",
      "Cosmic Sight",
      "A Portal In Times Of Need",
      "I Have Intervened"
     ]
  }
]