[
  {
    "code": "alias_investigations_by_christian_fecteau",
    "name": "Alias Investigations",
    "creator": "Christian Fecteau",
    "description": "Jessica Jones is ready to do whatever it takes to find the culprit of this kidnapping case, and that means she will team up with any hero who agrees to help. Players may choose whatever heroes and aspects they like in any combination. After beginning the campaign, deck lists cannot be modified, so be ready for anything.",
    "epilogue": "Check the Campaign Log. Count the number of checked boxes under “Jessica’s Wounds” and consult the table below.<br><br><b>3 checked boxes</b>: <i>Jessica Jones temporarily closes Alias Investigations. She thanks you for your help and tells you that she needs to take some time before she can get back to working on her own again.</i><br><b>2 checked boxes</b>:<i>You stop in on Alias Investigations a few weeks later. Jessica is mostly the same as you remember her. Business is slow, she tells you, but her clients know that they do good work, and that’s the important thing. You have a feeling that things will be tough for a bit, but she’ll get through it; she always does.</i><br><b>1 checked boxes</b>: <i>Business seems good for Alias Investigations. Jessica’s reputation in the community has grown since the last time you saw her. She meets up with you to catch up, and you share a good laugh about that one part of the case where she got knocked out and you had to finish the fight for her.</i><br><b>0 checked boxes</b>: <i>Jessica is thriving. Alias Investigations has expanded, and she’s hired a few new investigators to help with the workload. She thanks you again for your help during the case, and tells you that she couldn’t have done it without you.</i><br><br>Next, tally your victory points from all three scenarios to determine your investigator rank:<br><b>0-2 VP</b>: Resilient Rookie<br><b>3-5 VP</b>: Determined Detective<br><b>6-8 VP</b>: Skilled Sleuth<br><b>9-11 VP</b>: Master Investigator<br><b>12+ VP</b>: Super-Sleuth",
    "image": "alias_investigations.jpg",
    "type": "custom",
    "position": 110,
    "scenarios": [
      {
        "code": "rhino",
        "name": "Scenario #1 - Rhino (AKA Fight at the Facility)",
        "description": "Jessica Jones has asked for your help with tracking down the culprit who kidnapped her client, and so you’ve met her at her office – Alias Investigations – to work with her and figure out a strategy. Her investigation has hit a few dead ends, but she tells you that one of her contacts has reached out to her with a new lead: a folder of case files that are currently stored inside a safety deposit box at a S.H.I.E.L.D. facility.\n\nRight after she mentions this, the words “breaking news” flash across the screen of Jessica’s old TV: Rhino is forcing his way into a nearby S.H.I.E.L.D. site, and authorities are advising everyone to steer clear until the situation is resolved. You turn to Jessica, as though to ask if this might be the same S.H.I.E.L.D. building where the documents are being stored, but you can already tell the answer to that question from the way that Jessica is holding her head in her hands and sighing exasperatedly.\n\nThere’s no time to prepare or speculate as to whether the timing of Rhino’s attack is a coincidence – you and Jessica grab your things and rush to the facility. Heroics first, ask questions later.",
        "introduction": "After Step 1 (Select Heroes), each player records their name, identity, and aspect in the Campaign Log.\nAfter Step 11 (Shuffle Encounter Deck), assemble the Clue Deck using:\n* Radioactive Man (Core Set #129)\n* Madame Hydra (Core Set #181)\n* Mystique (Mutant Genesis #80)\n\nAfter Step 13 (Resolve Mulligans), the first player searches for the Jessica Jones ally (Core Set #59) and places her in play under the first player's control. She gains the text:\n* 'Victory -1'\n* 'Jessica Jones does not count against your ally limit.'",
        "resolution": "Check the victory display at the end of the scenario:\n* If Jessica Jones is present, check one box under 'Jessica’s Wounds' in the Campaign Log.\n* If the card revealed from the Clue Deck is in the victory display, record its name under 'Evidence Collected'.\n* If the revealed card is not in the victory display, record its name under 'Leads Pursued'.\n\nProceed to Scenario #2.",
        "image": "rhino_facility.jpg"
      },
      {
        "code": "project_wideawake",
        "name": "Scenario #2 - Sentinel (AKA Brawl at the Mall)",
        "description": "Although Rhino seemed to have no interest in the case file at the facility, another foe appeared partway through the battle, and they were determined to keep you from getting the contents of the safety deposit box. While it occurred to you that the enemy you encountered might be the person behind the kidnapping, Jessica doesn’t seem convinced; she thinks the real kidnapper probably sent someone to steal the files for them and wouldn’t risk going in person. “That one’s likely working with the kidnapper, though,” Jessica says. “I doubt we’ve seen the last of them.”<br><br>The documents you recovered from the facility are dense; you and Jessica take the files back to her office and start reading through them. As it turns out, Jessica’s client isn’t the only person kidnapped – the information you’ve found says that there’s been several superpowered people who have gone missing within the last few weeks, and all of them disappeared within a two-mile radius of the local mall. If what you’re reading is true, then it’s possible that all the kidnappings are the work of the same individual.<br><br>There’s only one way to find out, so you and Jessica head to the mall to check things out for yourselves.",
        "introduction": "After Step 8, check the Campaign Log. Add the corresponding encounter sets (Masters of Evil, Legions of Hydra, or Mystique) if their cards are listed under Leads or Evidence.\n\nAfter Step 10, search for any cards listed under 'Leads Pursued' and put them into play. They gain the text 'Victory 1'.\n\nAfter Step 11, assemble a new Clue Deck using:\n* Taskmaster’s Training Camp (#108)\n* Test Subjects (#123)\n* Intruder Alert! (#19)\n\nAfter Step 13, place the Jessica Jones ally in play under the first player’s control with her campaign text.",
        "resolution": "Record the results of the investigation:\n* If Jessica Jones is in the victory display, check one box under 'Jessica’s Wounds'.\n* If the new Clue card is in the victory display, record it as 'Evidence Collected'; otherwise, record it as 'Leads Pursued'.\n* For each Captive ally that entered play during the scenario, record their name under 'Victims Rescued'.\n* If a card listed under 'Leads Pursued' is in the victory display, move it to 'Evidence Collected'.",
        "image": "sentinel_mall.jpg"
      },
      {
        "code": "the_kidnapper_aka_the_final_battle",
        "name": "Scenario #3 - The Kidnapper (AKA The Final Battle)",
        "description": "After the battle at the mall, you and Jessica now know the identity of the kidnapper. You’ve discovered that they’ve used modified Sentinels to commit the kidnappings, and they’ve also enlisted minions to help cover their tracks. They didn’t cover things up well enough, though, because now you and Jessica where to find them.<br><br>All you need to do now is stop them.",
        "introduction": "Determine the Villain based on the Campaign Log:\n* If Taskmaster’s Training Camp is listed: Villain is Taskmaster.\n* If Test Subjects is listed: Villain is Zola.\n* If Intruder Alert! is listed: Villain is Master Mold.\n\nFollow the setup for the specific villain. Place any cards listed under 'Leads Pursued' into play. Assemble the Clue Deck using the 4 Captive allies, removing any whose names are already listed under 'Victims Rescued'. Place the Jessica Jones ally into play with her campaign text.",
        "resolution": "The final battle is over!\nRecord the name of the Captive ally revealed from the Clue Deck under 'Victims Rescued'.\nConsult the Epilogue based on the Campaign Log:\n* Count the boxes under 'Jessica’s Wounds' to determine Jessica's health and the future of Alias Investigations.\n* Tally your victory points to determine your investigator rank, from 'Resilient Rookie' to 'Super-Sleuth'.\nYou have won the campaign!",
        "image": "final_battle.jpg"
      }
    ],
    "modulars": {
      "rhino": [
        {
          "name": "Weapon Master",
          "code": "weap_master"
        }
      ],
      "project_wideawake": [
        {
          "name": "Masters of Evil",
          "code": "masters_of_evil"
        },
        {
          "name": "Legions of Hydra",
          "code": "legions_of_hydra"
        },
        {
          "name": "Mystique",
          "code": "mystique"
        }
      ],
      "the_kidnapper_aka_the_final_battle": [
        {
          "name": "Hydra Patrol",
          "code": "hydra_patrol"
        }
      ]
    },
    "campaign_notes": [
      "Leads Pursued",
      "Evidence Collected",
      "Victims Rescued"
    ],
    "campaign_counters": [
      "Jessica Wounds",
      "Victory Points"
    ]
  },
  {
    "code": "house_of_mojo_by_amanda_shagoury",
    "name": "House of Mojo",
    "creator": "Amanda Shagoury",
    "description": "This winter the hit TV show everyone has been talking about returns after 20 years. With five years and eight seasons of content to reference, what twists and turns will happen this season on House of Mojo?<br><br>This campaign is a celebration of Marvel Champions: The Card Game's 5-year anniversary. Players will take on a specific role within the team. This role will determine what upgrades can be unlocked by that player.",
    "epilogue": "",
    "image": "house_of_mojo.jpg",
    "type": "custom",
    "position": 111,
    "scenarios": [
      {
        "code": "en_sabah_nur",
        "name": "Scenario #1 - Training for the End of the World",
        "description": "After a well-known theme song that you’ll keep humming throughout this campaign, this story starts out like many others, training in the Danger Room. Today’s mission: stop the end of the world. Nothing we haven’t faced before and we all know our roles. We just need to adjust the settings before we start. Now what will help us prepare for anything life throws our way?",
        "introduction": "Each player records their identity and chooses a role from the table (Fighter, Tactician, Protector, or Tank). Put their condition upgrade in play.<br><br>As a team, decide which of these player side schemes you will attempt to complete:<br><ul><li>Assemble the Team</li><li>Establish Safehouse</li><li>Gear Up</li><li>Mission Prep</li><li>Practice Maneuvers</li><li>Prepare Defenses</li></ul><br><b>Note:</b> Apocalypse starts the game in his Biomorph form.",
        "resolution": "Check the setting modular encounter set used (Super Strength, Telepathy, or Flight). Based on the set, each player may add specific aspect or leadership events to their deck. Record the name of the events.<br><br><b>Outcomes:</b><br><ul><li>If the training side scheme was defeated, check “Training Side Scheme Thwarted”.</li><li>If the Hellfire Club modular set was used and defeated, check “Hellfire Club Disbanded”.</li></ul>",
        "image": "training_apocalypse.jpg"
      },
      {
        "code": "magneto_villain",
        "name": "Scenario #2 - Wanda’s Vision",
        "description": "Right as training ends, the alarm starts to sound. Over the intercom, Professor X says, slightly out of character,“Everyone, to the X-Jet! Cerebro has located a disturbance in the Savage Lands! Based on ratings and our limited time for character development, it seems that the Scarlet Witch is overwhelmed by… grief or something… and must be stopped! Magneto’s protecting her and he would rather destroy the world with Asteroid M than let her come to harm. And Sauron is still a danger roaming those lands! Think of the ratings!”",
        "introduction": "Put the X-Jet into play. Each player puts their condition upgrade into play on the basic side.<br><br><b>Campaign Adjustments:</b><br><ul><li>If “Training Side Scheme Thwarted” is checked, put that side scheme in play on its environment side.</li><li>If “Hellfire Club Disbanded” is checked, each player may add one copy of their Scenario #1 Event to their hand (this does not count toward the starting hand limit).</li></ul>",
        "resolution": "<b>Sauron:</b> If the Sauron modular set was used, check “Sauron Encountered”.<br><br><b>Advancement:</b> Check how far the main scheme advanced:<br><ul><li>If it reached “The Rule of Magnus”, check “Advanced 2”.</li><li>If it reached “Factory Online”, check “Advanced 1”.</li></ul>",
        "image": "wandas_vision.jpg"
      },
      {
        "code": "thanos",
        "name": "Scenario #3 - Balance Will Be Restored",
        "description": "Wanda changes reality to a world where mutants rule. Thanos has come to Earth to snap the world into alignment. Your team must stand together to stop half the world's population from being snapped from existence.",
        "introduction": "All friendly characters gain the MUTANT, X-MEN, X-FORCE, and X-FACTOR traits. Players may include trait-locked cards for these traits.<br><br><b>Setup:</b><br><ul><li>Place Public Outcry into play.</li><li>Shuffle Smear Campaign into the encounter deck.</li><li>If “Training Side Scheme Thwarted” is checked, put the player side scheme into play on its environment side.</li><li>Each player may put a copy of “Children of the Atom” into play.</li></ul>",
        "resolution": "Each player chooses to add a copy of Shawarma or the Market Card associated with their role to their deck. Record the decision.<br><br><b>Outcome:</b> If “The Infinity Stones” main scheme did not advance to “Balance the Scales”, check “The Team Has Gotten Stronger”. Wanda realizes her error but whispers: “No more mutants.”",
        "image": "thanos_balance.jpg"
      },
      {
        "code": "project_wideawake",
        "name": "Scenario #4 - Saving Grace",
        "description": "90% of the mutant population has lost their powers. The remaining mutants are being rounded up by Sentinels. The team plans a remarkable escape to start a new nation on Utopia.",
        "introduction": "To win this scenario, you must complete 4 tasks:<br>1. Defeat the Sentinel villain.<br>2. Rescue the mutants from the mission side scheme.<br>3. Have X-Jet in play.<br>4. Have Utopia in play.<br><br><b>Campaign Adjustments:</b><br><ul><li>If “Sauron Encountered” is checked, put the Magneto ally into play.</li><li>If “The Team Has Gotten Stronger” is checked, players put their condition upgrade into play on the advanced side.</li></ul>",
        "resolution": "Each player may add one player side scheme to their deck from any aspect. If the Genosha modular set was added, check “Escaped Genosha”. The team flies into the sunset towards Utopia.",
        "image": "sentinel_rescue.jpg"
      },
      {
        "code": "mojo",
        "name": "Scenario #5 - Mojo All Along",
        "description": "Mojo was behind the twists and turns all along. He brings out his Wheel of Genres and traps you in a family-friendly sitcom. You need to find a way out of Mojo’s clutches to get back to real life.",
        "introduction": "Put Longshot into play under the first player’s control.<br><br><b>Campaign Adjustments:</b><br><ul><li>If the team added the Arcade set, each player adds their Role Upgrade to their deck.</li><li>If “Training Side Scheme Thwarted” is checked, put the player side scheme into play on its environment side.</li><li>If “The Team Has Gotten Stronger” is checked, players put their condition upgrade into play on the advanced side.</li><li>If “Escaped Genosha” is checked, players may put one of the recorded player side schemes from Scenario #4 into play.</li></ul>",
        "resolution": "You escape and wake up in your bed at the mansion. Is this really reality or just another illusion? The players win the campaign!",
        "image": "mojo_sitcom.jpg"
      }
    ],
    "modulars": {
      "en_sabah_nur": [
        {
          "name": "Clan Akkaba",
          "code": "clan_akkaba"
        },
        {
          "name": "Super Strength",
          "code": "super_strength"
        },
        {
          "name": "Telepathy",
          "code": "telepathy"
        },
        {
          "name": "Flight",
          "code": "flight"
        },
        {
          "name": "Hellfire Club",
          "code": "hellfire"
        }
      ],
      "magneto_villain": [
        {
          "name": "Savage Land",
          "code": "savage_land"
        },
        {
          "name": "Sauron",
          "code": "sauron"
        }
      ],
      "thanos": [
        {
          "name": "Infinity Gauntlet",
          "code": "infinity_gauntlet"
        },
        {
          "name": "Legions of Hydra",
          "code": "legions_of_hydra"
        },
        {
          "name": "Hydra Assault",
          "code": "hydra_assault"
        }
      ],
      "project_wideawake": [
        {
          "name": "Zero Tolerance",
          "code": "zero_tolerance"
        },
        {
          "name": "Dystopian Nightmare",
          "code": "dystopian_nightmare"
        },
        {
          "name": "Genosha",
          "code": "genosha"
        }
      ],
      "mojo": [
        {
          "name": "Sitcom",
          "code": "sitcom"
        },
        {
          "name": "Arcade",
          "code": "arcade"
        }
      ]
    },
    "campaign_notes": [
      "Role",
      "Market or Shawarma",
      "Player Side Scheme"
    ],
    "campaign_counters": [],
    "campaign_checkbox": [
      "Flight",
      "Super Strength",
      "Telepathy",
      "Training Side Scheme Thwarted",
      "Hellfire Club Disbanded",
      "Sauron Encountered",
      "Advanced 1",
      "Advanced 2",
      "The Team Has Gotten Stronger",
      "Escaped Genosha"
    ]
  },
  {
    "code": "revenge_of_the_black_order_by_karl_resch",
    "name": "Revenge of the Black Order",
    "creator": "Karl Resch",
    "description": "The Revenge of the Black Order campaign is made up of three scenarios, all dependent on how the heroes are spending their downtime during a surprise invasion. As the assault intensifies, each group has to tackle different challenges in order to turn the tide of battle and save the day.<br><br><b>Choose your Path:</b><br><ul><li><b>First Response:</b> Identities must possess either the Attorney, Civilian, Genius, Mystic, or Scientist trait.</li><li><b>Spec Ops:</b> Identities must possess either the Android, King, Mercenary, S.H.I.E.L.D., Soldier, Spy, or Wakanda trait.</li><li><b>Direct Assault:</b> Identities must possess either the Asgard, Inhuman, Mutant, or Outlaw trait.</li></ul>",
    "image": "black_order_revenge.jpg",
    "type": "custom",
    "position": 112,
    "scenarios": [
      {
        "code": "venom",
        "name": "Scenario #1A - Krazy Klyntar (First Response)",
        "description": "Nothing beats a day to yourself, but the tranquil silence is broken by screams and sirens. The sky is starting to fill with spaceships launching fighters and deploying troops commanded by elite warriors; you recognize them as servants of the Mad Titan, Thanos. Amidst the confusion, oily tendril-snakes slither from sewers to be collected by skiffs. You head into the fray, noticing Venom, the lethal protector, twitching strangely. Suddenly, he grabs and tackles you in a state of mindless savagery. You knock him into a nearby bell tower to loosen his grip.",
        "introduction": "Each player records their identity in the campaign log. Put the Metro PD Support and the Save the Shawarma Place side scheme into play. Each player shuffles a copy of the Martial Law obligation into their deck and records it in the campaign log under Obligations.<br><br><b>Black Order:</b> In the campaign log under Black Order, mark the Black Dwarf, Supergiant, and Black Swan boxes.",
        "resolution": "Venom collapses, stunned by the bell’s soundwaves. If Save the Shawarma Place was defeated, mark the Shawarma box in the campaign log. For every Black Order Minion in the victory display, unmark the box with their name under the Black Order section of the campaign log.",
        "image": "venom_klyntar.jpg"
      },
      {
        "code": "tower_defense",
        "name": "Scenario #1B - Defend It and Hope (Spec Ops)",
        "description": "The attack came without warning. S.W.O.R.D. Command and Alpha Flight Station had no time to retaliate, only issue warnings of a massive fleet led by Thanos' Black Order. Your mission is to protect valuable strongholds and assets while establishing other bases of operations. The obvious first attack is against Avengers Tower, a bastion of defense and knowledge for the superpowers of Earth. The world has descended into chaos, but you have the skills to rise above and protect it.",
        "introduction": "Each player records their identity. Discard cards from the top of the encounter deck until a Setting environment is discarded and put it into play. Put the Establish Safehouse player side scheme into play. Shuffle the Security Breach side scheme into the Encounter Deck.<br><br><b>Damage:</b> Place damage on Avengers Tower based on the chosen difficulty (1 per player for Standard, 2 for Expert).",
        "resolution": "If the Avengers Tower has the Damaged trait, mark Tower Damaged in the campaign log. If the Safehouse Established environment is in play, mark Safehouse Secured. If Security Breach is in the Victory Display, mark the Security Breach box. Mark the Proxima Midnight and Corvus Glaive boxes under Black Order.",
        "image": "tower_defense.jpg"
      },
      {
        "code": "magog",
        "name": "Scenario #1C - Who Will Fight Me? (Direct Assault)",
        "description": "Parallel universes, mythical beings, and new abilities are daily occurrences on Earth, so the panic over an alien attack seems redundant to you. However, getting to your ship won't be easy as the city is locked down. A red alien giant, MaGog, emerges from the sewers overturning police cars and causing first responders to scatter. 'Earth shall fall! New masters shall emerge!' he shouts, laughing maniacally. You step forward into a cityscape twisted into an arena, ready to make short work of him and get to the real fight in space.",
        "introduction": "Each player records their identity in the campaign log. Players cannot switch identities during a campaign.",
        "resolution": "If the Longshot ally is in play, mark the Scenario 2 box in the Longshot Ally section of the campaign log. Each player may choose one support or upgrade they control with a cost of two or less and record it under Gear Up. These cards can be put into play at the start of future scenarios at the cost of additional threat on the main scheme.",
        "image": "magog_arena.jpg"
      },
      {
        "code": "brotherhood_of_badoon",
        "name": "Scenario #2 - Badoon Bombardment",
        "description": "More ships fly into view, supporting large cannons gathering energy for a direct assault. The Badoon leader, Drang, is commanding his fleet to strike targets throughout the city, including safehouses where people have taken cover. Whether you are coming from the streets of New York, the ruins of Avengers Tower, or the Blue Area of the Moon, the pressure is mounting. You must stop the alien commander to prevent the bombardment from devastating the population.",
        "introduction": "Follow the instructions for your chosen Campaign Path:<br><ul><li><b>First Response:</b> Put Metro PD into play. If Shawarma is marked, shuffle it into your deck. Shuffle recorded Obligations and Panicked Refugees into your deck. Put marked Black Order minions into play or the deck.</li><li><b>Spec Ops:</b> Put Rogue Vessel and Safehouse Established (if marked) into play. Shuffle Corvus Glaive, Proxima Midnight, and Security Breach (if not marked) into the deck.</li><li><b>Direct Assault:</b> One player puts Gladiator into play engaged with them. If Scenario 2 is marked for Longshot, put him into play. Put recorded Gear Up cards into play by adding threat to the main scheme.</li></ul>",
        "resolution": "For every Black Order Minion in the victory display, unmark their box. If playing First Response and Panicked Refugees was removed from the game, remove it from the Obligations list. If playing Spec Ops and Security Breach is in the victory display, mark it. If playing Direct Assault and Longshot is in play, mark his Scenario 3 box.",
        "image": "badoon_bombardment.jpg"
      },
      {
        "code": "ebony_maw",
        "name": "Scenario #3 - Mysteries and Magic",
        "description": "The Black Order's mastermind, Ebony Maw, emerges unphased by your victories. He stands amongst the rubble, sensing your frustration and fear. Whether he is disrupting your perfect day, attacking the landing pad of Avengers Tower, or morphing with Klyntar tendrils on the Moon, his power is immense. Portals open around him, bringing forth wondrous and mysterious creatures of the cosmos. He mocks your military might and training, claiming you lack an understanding of true strength.",
        "introduction": "Follow the setup for your Campaign Path:<br><ul><li><b>First Response:</b> Put Metro PD and Mojo in the Middle into play. Shuffle Shawarma and marked Black Order minions into the deck.</li><li><b>Spec Ops:</b> Put Safehouse Established (if marked) into play. Shuffle Security Breach and marked Black Order minions into the deck.</li><li><b>Direct Assault:</b> If Scenario 3 is marked for Longshot, put him into play. Put recorded Gear Up cards into play by adding threat to the main scheme.</li></ul>",
        "resolution": "Ebony Maw staggers and disappears through a portal. The ships disperse, clearing the sky. You are left with disarray and questions. It seems the Black Order was testing Earth's defenses. Across the cosmos, Thanos nodes in approval; he has tested the new alliances and now looks toward the other eight realms before returning for a final assault.",
        "image": "ebony_maw_final.jpg"
      }
    ],
    "modulars": {
      "venom": [
        {
          "name": "Symbiotic Strength",
          "code": "symbiotic_strength"
        },
        {
          "name": "Black Order",
          "code": "black_order"
        }
      ],
      "tower_defense": [
        {
          "name": "Streets of Mayhem",
          "code": "streets_of_mayhem"
        }
      ],
      "magog": [
        {
          "name": "Band of Badoon",
          "code": "band_of_badoon"
        },
        {
          "name": "Longshot",
          "code": "longshot"
        }
      ],
      "brotherhood_of_badoon": [
        {
          "name": "Flight",
          "code": "flight"
        },
        {
          "name": "Kree Militants",
          "code": "kree_militant"
        },
        {
          "name": "Blue Moon",
          "code": "blue_moon"
        }
      ],
      "ebony_maw": [
        {
          "name": "Sitcom",
          "code": "sitcom"
        },
        {
          "name": "Telepathy",
          "code": "telepathy"
        },
        {
          "name": "Legions of Hel",
          "code": "legions_of_hel"
        },
        {
          "name": "Menagerie Medley",
          "code": "menagerie_medley"
        },
        {
          "name": "Symbiotic Strength",
          "code": "symbiotic_strength"
        }
      ]
    },
    "campaign_notes": [
      "Story Path",
      "Obligations",
      "Gear Up",
      "Black Order",
      "Safehouse Secured",
      "Longshot Ally",
      "Security Breach",
      "Tower Damaged",
      "Shawarma",
      "Narrative Campaign Restrictions"
    ],
    "campaign_counters": [
      "Remaining Hit Points"
    ]
  },
  {
    "code": "she_hulk_vs_deadpool_game_night_by_kurt_hake",
    "name": "She-Hulk vs. Deadpool’s Game Night",
    "creator": "Kurt Hake",
    "description": "This campaign is a story about the rivalry between everyone's favorite fourth-wall breakers: She-Hulk and Deadpool. Deadpool has set up a series of metagame challenges to prove who is better at card games. Players take She-Hulk's side to navigate the unpredictable chaos of the 'Pool aspect.<br><br><b>Requirements:</b> One player must be She-Hulk. Other players must be Avengers or X-Force (but not Deadpool).",
    "image": "game_night.jpg",
    "type": "custom",
    "position": 113,
    "scenarios": [
      {
        "code": "red_skull",
        "name": "Scenario #1 - Game Night Begins",
        "description": "With the power of the Reality Stone, Red Skull begins to remake the world. The Avengers assemble to stop him, but their meeting is interrupted by the X-Force and Deadpool, who wants to prove he's better than She-Hulk at Marvel Champions. Suddenly, Lady Deathstrike and her Reavers crash through the windows. Deadpool claims he has a double agent inside Hydra, but She-Hulk isn't convinced.",
        "introduction": "Record your Avenger or X-Force hero identity. One player must be She-Hulk. The first player puts the Deadpool ally into play. She-Hulk shuffles the War upgrade into her deck, searches the encounter deck for Lady Deathstrike, and deals her to herself as a facedown encounter card.",
        "resolution": "If the scenario is won, add 1 to the Strength of the Alliance. Deadpool steals the Reality Stone, and you add Stick-to-itiveness and Laser Swords to the Reward Pool. If the METAGAME challenge (defeat a Reaver with War) was completed, She-Hulk wins the game 'War'. Otherwise, Deadpool wins it.",
        "image": "red_skull_game.jpg"
      },
      {
        "code": "four_horsemen",
        "name": "Scenario #2 - The Lord of the Wings",
        "description": "Deadpool transforms the heroes' surroundings into a strange fantasy world to prove he's the best at everything. Winged monsters Sauron and Death descend upon the heroes. She-Hulk is furious that Deadpool is playing games with reality just because he's jealous she was in the Core Set. It's time to show him who is really the best at card games.",
        "introduction": "Randomly deal the Reward Pool among players and shuffle the cards into your decks. The first player searches the encounter deck for the A Game of Mojo's environment and the Sauron Lives! side scheme and puts them into play.",
        "resolution": "If the scenario is won, She-Hulk stands triumphant, but Deadpool refuses to give up the stone. Add 'Lord of the Wings' to Games Won for She-Hulk. If the METAGAME challenge (confuse Death with Blackout) was completed, She-Hulk wins 'Blackout'. Update the Strength of the Alliance if the teamwork goal was met.",
        "image": "fantasy_deadpool.jpg"
      },
      {
        "code": "risky_business",
        "name": "Scenario #3 - Android Web-Hacker",
        "description": "The fantasy world is replaced with a dystopian futuristic cityscape. Deadpool challenges you to take down an evil corporation in his version of 'Android Web-hacker'. She-Hulk is ready to use her fists against corporate corruption, but she suggests bringing along some Android allies to help hack the systems.",
        "introduction": "Deal the Reward Pool at random. Search the encounter deck for the Mojo Runner environment and the ICE-teroid M side scheme and put them into play. Apply ice counters to schemes whenever Criminal Enterprise enters play.",
        "resolution": "If victory is achieved, She-Hulk celebrates. Deadpool taunts that hacking wasn't his specialty anyway and prepares for the next game before his 'buyer' arrives. Record wins for 'Android Web-hacker' and 'Tic-Tac-Toe' based on the METAGAME challenge (defeat a Program with Tic-Tac-Toe).",
        "image": "cyberpunk_hacker.jpg"
      },
      {
        "code": "en_sabah_nur",
        "name": "Scenario #4 - Akkaba Horror",
        "description": "Reality transforms again, growing dark and spooky. The heroes find themselves inside a foul chamber where a cult ritual is taking place. Deadpool remains disturbingly cheerful, inviting everyone to play 'Akkaba Horror'. He warns you not to lose your mind, though he thinks sanity is overrated anyway.",
        "introduction": "Deal the Reward Pool. Search the encounter deck for the Mojo Files environment and the Cultist minion and put them into play. Place 3 sanity counters on each identity. Players lose sanity when revealing Treachery cards; losing all counters means defeat.",
        "resolution": "The heroes win against Clan Akkaba, but She-Hulk has had enough. Deadpool seemingly relents as reality returns to normal, but a huge spaceship fills the sky. Record wins for 'Akkaba Horror' and 'Rock, Paper, Scissors' based on the metagame challenge.",
        "image": "apocalypse_horror.jpg"
      },
      {
        "code": "escape_the_museum",
        "name": "Scenario #5 - The Game Collection",
        "description": "Deadpool turns on the heroes, trapping them in giant game boxes and loading them onto a ship. He has sold the Reality Stone and the heroes to Taneleer Tivan, The Collector. You are taken to the Museum to live like pawns on a board. She-Hulk is ready to punch Deadpool's face, but he claims he always planned to break you out—after getting paid.",
        "introduction": "Deal the Reward Pool. Put the Deadpool ally into play. For each game won by Deadpool, trigger a corresponding penalty (adding modular sets like Flight, Telepathy, or revealing side schemes). She-Hulk deals herself the Card Shark minion.",
        "resolution": "Free from the boxes, the heroes head home. The Reality Stone is reclaimed and kept far from Deadpool. She-Hulk threatens Deadpool with 'lawfare' if he ever tries to steal her team name again. You win the campaign!",
        "image": "collector_museum.jpg"
      }
    ],
    "modulars": {
      "red_skull": [
        {
          "name": "Deathstrike",
          "code": "deathstrike"
        },
        {
          "name": "Reavers",
          "code": "reavers"
        }
      ],
      "four_horsemen": [
        {
          "name": "Sauron",
          "code": "sauron"
        },
        {
          "name": "Fantasy",
          "code": "fantasy"
        }
      ],
      "risky_business": [
        {
          "name": "Sci-Fi",
          "code": "sci-fi"
        }
      ],
      "en_sabah_nur": [
        {
          "name": "Clan Akkaba",
          "code": "clan_akkaba"
        },
        {
          "name": "Horror",
          "code": "horror"
        }
      ],
      "escape_the_museum": [
        {
          "name": "Galactic Artifacts",
          "code": "galactic_artifacts"
        },
        {
          "name": "Ship Command",
          "code": "ship_command"
        },
        {
          "name": "Western",
          "code": "western"
        },
        {
          "name": "Flight",
          "code": "flight"
        },
        {
          "name": "Telepathy",
          "code": "telepathy"
        },
        {
          "name": "Super Strength",
          "code": "super_strength"
        }
      ]
    },
    "campaign_notes": [
      "Games Won For She-Hulk",
      "Reward Pool",
      "Games Won For Deadpool"
    ],
    "campaign_counters": [
      "Strength Of The Alliance",
      "Time Stone Rewinds"
    ]
  },
  {
    "code": "watcher_team_what_if_by_zach_goscha",
    "name": "The Watcher’s Team: What If...?",
    "creator": "Zach Goscha",
    "description": "I am The Watcher. I observe many realities beyond the one you know. In this campaign, we explore unique stories where heroes are not who they seem. You will be forced to change identities to witness these vast changes across the multiverse.",
    "image": "watcher_what_if.jpg",
    "type": "custom",
    "position": 114,
    "scenarios": [
      {
        "code": "ebony_maw",
        "name": "Scenario #1 - Iron Man: Trapped In Time",
        "description": "Tony Stark finds himself in a fantasy realm of King Arthur. A powerful wizard is after a special gem, using dragons and frost giants to besiege the grand cities. We must answer the question: What if Iron Man was trapped in the time of King Arthur?",
        "introduction": "Iron Man must be one of the identities used. Add Godslayer to his deck with the Setup and Permanent keywords. To advance, Iron Man must use Godslayer in the final attack to reduce the villain to zero. Shuffle System Shock into the encounter deck.",
        "resolution": "If the Dragon minion was defeated, players gain the Endless Possibilities ability. Iron Man is victorious, but Ebony Maw casts a portal spell that sucks him away to another realm.",
        "image": "king_arthur_ironman.jpg"
      },
      {
        "code": "stryfe",
        "name": "Scenario #2 - Spider-Man: The Sorcerer Supreme",
        "description": "In this world, Peter Parker is a mystic rather than a street-level Avenger. He faces a time-traveling villain from the future to save Hope Summers. Suddenly, a portal opens and an Iron Man in red and gold plate armor emerges from the Arthurian timeline to help.",
        "introduction": "Spider-Man (Peter Parker) must be used and gains the Mystic trait. Add The Sorcerer Supreme to his deck. Players must also use the Iron Man identity from the previous scenario. Deal Black Tom Cassidy as a facedown encounter card to Spider-Man.",
        "resolution": "If a Spell card was used to finish the villain, players gain the Cosmic Sight ability. Spider-Man senses danger coming from the Underworld and plunges into the rift with Iron Man.",
        "image": "sorcerer_supreme_spiderman.jpg"
      },
      {
        "code": "hela",
        "name": "Scenario #3 - Rogue And The Power Of Thor",
        "description": "Anna Marie is a god. Wielding Jarnbjorn, she enters Hel to save Odin from Hela. A portal opens and she is joined by the Sorcerer Supreme Spider-Man and the Arthurian Knight Iron Man. They agree to help her, sensing a high level of cosmic danger looming.",
        "introduction": "Rogue must be used and gains the Asgard trait. Add Jarnbjorn to her deck. Players must also select either Iron Man or Spider-Man from the previous scenarios. Attach an attachment to the villain from the encounter deck.",
        "resolution": "If Hela was flipped to her Wounded side 4+ times, players gain A Portal In Times Of Need. The Watcher reveals himself to the heroes, warning of a great and terrible enemy at hand.",
        "image": "thor_rogue.jpg"
      },
      {
        "code": "the_hood",
        "name": "Scenario #4 - Captain America: Vigilante Justice",
        "description": "Steve Rogers has taken on the role of an aggressive vigilante, tearing through street-level crime with weapons and little mercy. Wearing red, white, and blue with a dark expression, he reluctantly joins the heroes gathered by The Watcher to stop The Hood.",
        "introduction": "Captain America must be used and gains the Civilian trait. His deck must include at least 6 cards with the Weapon trait. Add Lock and Load and Laser Cannon to his deck. Players take damage, place threat, or discard cards at random.",
        "resolution": "If 5 minions were defeated with Weapon cards, players gain the I Have Intervened ability. The Watcher informs the four unique heroes that the fate of the universe is in their hands as he transports them to the final battle.",
        "image": "vigilante_captain_america.jpg"
      },
      {
        "code": "ultron",
        "name": "Scenario #5 - The Watcher’s Team",
        "description": "I will watch no more as another world ends. I have intervened. In this timeline, Ultron has gained the Infinity Gauntlet and seeks to destroy the planet with nuclear codes. I have gathered the most unique heroes from across the multiverse to defeat him once and for all.",
        "introduction": "Players must select identities used in the previous scenarios and follow their unique setup rules. For each player, draw and reveal a card from the Infinity Stone deck.",
        "resolution": "Ultron is defeated and the players win the campaign! I am The Watcher. I will no longer simply watch if a new evil arises to change the multiverse for the worse. We will continue to explore: What If...?",
        "image": "ultron_gauntlet.jpg"
      }
    ],
    "modulars": {
      "ebony_maw": [
        {
          "name": "Fantasy",
          "code": "fantasy"
        },
        {
          "name": "Frost Giants",
          "code": "frost_giants"
        }
      ],
      "stryfe": [
        {
          "name": "Hope Summers",
          "code": "hope_summers"
        },
        {
          "name": "Horror",
          "code": "horror"
        },
        {
          "name": "Black Tom Cassidy",
          "code": "black_tom_cassidy"
        }
      ],
      "hela": [
        {
          "name": "Legions of Hel",
          "code": "legions_of_hel"
        },
        {
          "name": "Enchantress",
          "code": "enchantress"
        }
      ],
      "the_hood": [
        {
          "name": "Streets of Mayhem",
          "code": "streets_of_mayhem"
        },
        {
          "name": "Zzzax",
          "code": "zzzax"
        },
        {
          "name": "Ransacked Armory",
          "code": "ransacked_armory"
        },
        {
          "name": "Running Interference",
          "code": "running_interference"
        },
        {
          "name": "Down To Earth",
          "code": "down_to_earth"
        },
        {
          "name": "Weapon Master",
          "code": "weap_master"
        },
        {
          "name": "Iron Spider's Sinister Six",
          "code": "ironspider_sinister"
        }
      ],
      "ultron": [
        {
          "name": "Infinity Gauntlet",
          "code": "infinity_gauntlet"
        }
      ]
    },
    "campaign_notes": [
      "Endless Possibilities",
      "Cosmic Sight",
      "A Portal In Times Of Need",
      "I Have Intervened"
    ],
    "campaign_counters": [
      "Remaining Hit Points"
    ]
  }
]