{
    "code": "secret_empire_by_relaxingglitch",
    "name": "Secret Empire",
    "creator": "Marvin P. (Relaxingglitch)",
    "description": "The Secret Empire campaign combines three scenarios set when the Superhero Registration Act has just been written into law. The heroes find themselves in the crosshairs of a government that has been secretly taken over by Hydra. It is up to you to root out Hydra and restore freedom across the land before it is too late.",
    "epilogue": "Deep in outer space, the Sanctuary floats above Knowhere. Thanos wreaked havoc upon the Guardians' home base to obtain the Power Stone. He inserts the stone into his Infinity Gauntlet. \"Five down, one to go.\"",
    "image": "secret_empire.jpg",
    "type": "custom",
    "position": 154,
    "scenarios": [
        {
            "code": "taskmaster",
            "name": "Scenario #1 - Superhuman Registration Act",
            "description": "<i>In the aftermath of the superhero civil war, the Superhuman Registration Act passed. Despite opposition from many superheroes who view this as an encroachment on civil liberties and can put a target on their backs. The government has been given the ability to monitor all superpowered individuals. Now, S.H.I.E.L.D. has been tasked with tracking heroes, but something does not add up. The heroes who complied with the law have started to go missing. Taskmaster is leading a S.H.I.E.L.D. task force for hunting down superheroes regardless of who is complying with the law or not. New intel from Agent Coulson indicates Taskmaster is in league with Hydra. You thought the last head had been cut off decades ago. You were wrong. It is up to you to investigate and stop him from kidnapping more heroes.</i>",
            "introduction": "For this scenario, Hydra minions gain the S.H.I.E.L.D. trait (they are in disguise).<br>Put the Establish Safehouse (Next Evolution #194A) side scheme into play and set aside Safehouse (Next Evolution #197).<br>Shuffle the On the Hunt (The Galaxy's Most Wanted #184) treachery into the encounter deck.<br>Shuffle the Crossbones (Winter Soldier #28) minion into the encounter deck.",
            "resolution": "If there were allies rescued from the Taskmaster encounter set, the players as a group decides which ally each player will receive (regardless of whose player deck they were added to during the scenario) and adds that ally to their deck. Record their name(s) in the campaign log. Each player can only receive 1 ally. Each ally that was not rescued or chosen is removed from the campaign.<br>Record in the campaign log if the Safehouse Established environment (Next Evolution #194B) is in play.<br><br><b>Expert Campaign Only:</b> Record each identity's remaining hit points in the campaign log.",
            "epilogue": "",
            "image": "taskmaster_registration.jpg"
        },
        {
            "code": "baron_zemo",
            "name": "Scenario #2 - Hydra Uprising",
            "description": "<i>Taskmaster has retreated, but you discover the S.H.I.E.L.D. agents he led have been Hydra sleeper agents all along! They have been identifying, hunting down, and imprisoning superheroes at The Raft. Hydra has been secretly infiltrating organizations and our government for years. The Superhero Registration Act started as a bill written by a senator who is a covert member of Hydra. Even the S.H.I.E.L.D. Executive Board has a Hydra mole, but you are not sure which one. They need to be identified before they continue to abuse their power.<br><br>You make your way to the Triskelion in Washington D.C., to discover Baron Zemo, leader of the Thunderbolts, is now the Director. You need to gather evidence to prove to the other board members that Zemo and his Hydra accomplices have taken over S.H.I.E.L.D. before their influence fully takes hold.</i>",
            "introduction": "For this scenario, S.H.I.E.L.D. minions gain the Hydra trait. Baron Zemo on the Unmasked side (A2 and B2) gains the Hydra trait.<br>Follow the instructions in the Agents of S.H.I.E.L.D. rulebook on page 18. Setup as \"if you are not playing in campaign mode, follow the steps under 'Preparing the Evidence' on page 5.\"<br>Put the Gear Up (Next Evolution #192A) side scheme into play and set aside each of the Pouches (Next Evolution #196) resource cards.<br>Shuffle the Overburden (Next Evolution #203) treachery into the encounter deck.<br>Deal the Taskmaster (Black Widow #26) minion as a facedown encounter card to the first player.<br>If the Safehouse Established environment was recorded in the campaign log, put it into play and set aside Safehouse (Next Evolution #197). Shuffle the On the Hunt (The Galaxy's Most Wanted #184) treachery into the encounter deck if the Safehouse Established environment is in play.<br><br><b>Expert Campaign Only:</b> Set each player's hit points to their remaining hit point value recorded in the campaign log from the previous scenario.<br><b>Expert Campaign Only:</b> Each player may add 1 random obligation from their expert campaign set to their deck to heal their identity back to its full hit point value.",
            "resolution": "Record the number of secret counters on all S.H.I.E.L.D. Executive Board cards in the campaign log.<br>If the players guessed the mole correctly during The Accusation (2A/2B main scheme), each player searches their collection for 1 ally outside of their chosen aspect, but they must have different names. Record its name in the campaign log and add it to their deck.<br>If the players guessed the mole incorrectly during The Accusation, each player chooses 1 upgrade outside of their chosen aspect, records its name in the campaign log and add it to their deck.<br>Record in the campaign log if the Geared Up environment (Next Evolution #192B) is in play.<br><br><b>Expert Campaign Only:</b> Record each identity's remaining hit points in the campaign log, as well as any expert campaign set card added to their deck.",
            "epilogue": "",
            "image": "zemo_uprising.jpg"
        },
        {
            "code": "red_skull",
            "name": "Scenario #3 - Red Dawn",
            "description": "<i>The power Baron Zemo and his Hydra accomplices had over S.H.I.E.L.D. has been removed. The bad news is that their true goal has been revealed. They were after a top-secret weapon within Project Pegasus. Hydra has been learning how to harness the power of the Reality Stone, which can manipulate physical existence. Their recent triumph was using the stone to bring the nefarious Red Skull back from the dead. Now, reality is bending to his will, allowing Hydra to conquer the United States of America. However, Red Skull will not stop there, as he plans to usher in his fascist rule across the world. You must defeat him before he masters the use of the Reality Stone!</i>",
            "introduction": "Follow the instructions in The Rise of Red Skull rulebook on page 15 for the Side Scheme Deck rules.<br>For this scenario, if Reluctant Foe is revealed, the players may suspend the Unique Icon rule for the \"When Revealed\" effect. The attached minion gains the Hydra trait.<br>The players as a group decide on which modular set to shuffle into the encounter deck.<br><ul><li><b>A Bone to Pick:</b> After thwarting Hydra's kidnapping scheme, Crossbones has a grudge against you. If you choose to confront him, shuffle the Winter Soldier Nemesis (Winter Soldier Hero Pack) modular set into the encounter deck.</li><li><b>Unfinished Business:</b> Baron Zemo wants revenge after you unmasked his true allegiance to Hydra. If you choose to face him, shuffle the Captain America Nemesis (Captain America Hero Pack) modular set into the encounter deck.</li></ul><br>Put the Assemble the Team (Next Evolution #190A) side scheme into play.<br>Shuffle The Viper (The Rise of Red Skull #54) minion into the encounter deck.<br>Shuffle the Reluctant Foe (Agents of S.H.I.E.L.D. #171) attachment into the encounter deck.<br>Place threat on the main scheme equal to the number of secret counters recorded in the campaign log.<br>If the Safehouse Established environment was recorded in the campaign log, put it into play and set aside Safehouse (Next Evolution #197). Shuffle the On the Hunt (The Galaxy's Most Wanted #184) treachery into the encounter deck if the Safehouse Established environment is in play.<br>If the Geared Up (Next Evolution #192B) environment was recorded in the campaign log, put it into play and set aside each Pouches resource cards (Next Evolution #196). Shuffle the Overburdened (Next Evolution #203) treachery into the encounter deck if the Geared Up environment is in play.<br><br><b>Expert Campaign Only:</b> Set each player's hit points to their remaining hit point value recorded in the campaign log from the previous scenario.<br><b>Expert Campaign Only:</b> Each player may add 1 random obligation from their expert campaign set to their deck to heal their identity back to its full hit point value.<br><b>Expert Campaign Only:</b> If the players lose this game, Red Skull conquers the world, and the players lose the campaign.",
            "resolution": "Hydra has been defeated, and the players win the campaign!",
            "epilogue": "",
            "image": "red_skull_dawn.jpg"
        }
    ],
    "modulars": {
        "taskmaster": [
            {
                "name": "Hydra Patrol",
                "code": "hydra_patrol"
            },
            {
                "name": "S.H.I.E.L.D.",
                "code": "s.h.i.e.l.d."
            }
        ],
        "baron_zemo": [
            {
                "name": "S.H.I.E.L.D. Executive Board",
                "code": "s.h.i.e.l.d._executive_board"
            },
            {
                "name": "Executive Board Evidence",
                "code": "executive_board_evidence"
            },
            {
                "name": "Military Grade",
                "code": "military_grade"
            },
            {
                "name": "Legions of Hydra",
                "code": "legions_of_hydra"
            }
        ],
        "red_skull": [
            {
                "name": "Hydra Assault",
                "code": "hydra_assault"
            },
            {
                "name": "Captain America Nemesis",
                "code": "captain_america_nemesis"
            },
            {
                "name": "Winter Soldier Nemesis",
                "code": "winter_soldier_nemesis"
            }
        ]
    },
    "campaign_notes": [
        "Rescued Captive Ally",
        "Chosen Ally OR Upgrade"
    ],
    "campaign_counters": [
        "Number of secret counters in play"
   
    ],
    "campaign_checkbox": [
        "Safehouse Established environment in play?",
        "Geared up environment in play?",
        "Guessed the mole correctly?"
    ]
}